YutakaMatsubara/toppers-asp_riscv/target/k210_gcc/kendryte-k210.h
/*
 *  TOPPERS/ASP Kernel
 *      Toyohashi Open Platform for Embedded Real-Time Systems/
 *      Advanced Standard Profile Kernel
 * 
 *  Copyright (C) 2000-2003 by Embedded and Real-Time Systems Laboratory
 *                              Toyohashi Univ. of Technology, JAPAN
 *  Copyright (C) 2005-2011 by Embedded and Real-Time Systems Laboratory
 *              Graduate School of Information Science, Nagoya Univ., JAPAN
 *  Copyright (C) 2017-2019 by TOPPERS PROJECT Educational Working Group.
 *
 *  上記著作権者は，以下の (1)〜(4) の条件か，Free Software Foundation 
 *  によって公表されている GNU General Public License の Version 2 に記
 *  述されている条件を満たす場合に限り，本ソフトウェア（本ソフトウェア
 *  を改変したものを含む．以下同じ）を使用・複製・改変・再配布（以下，
 *  利用と呼ぶ）することを無償で許諾する．
 *  (1) 本ソフトウェアをソースコードの形で利用する場合には，上記の著作
 *      権表示，この利用条件および下記の無保証規定が，そのままの形でソー
 *      スコード中に含まれていること．
 *  (2) 本ソフトウェアを，ライブラリ形式など，他のソフトウェア開発に使
 *      用できる形で再配布する場合には，再配布に伴うドキュメント（利用
 *      者マニュアルなど）に，上記の著作権表示，この利用条件および下記
 *      の無保証規定を掲載すること．
 *  (3) 本ソフトウェアを，機器に組み込むなど，他のソフトウェア開発に使
 *      用できない形で再配布する場合には，次のいずれかの条件を満たすこ
 *      と．
 *    (a) 再配布に伴うドキュメント（利用者マニュアルなど）に，上記の著
 *        作権表示，この利用条件および下記の無保証規定を掲載すること．
 *    (3) 再配布の形態を，別に定める方法によって，TOPPERSプロジェクトに
 *        報告すること．
 *  (4) 本ソフトウェアの利用により直接的または間接的に生じるいかなる損
 *      害からも，上記著作権者およびTOPPERSプロジェクトを免責すること．
 *
 *  本ソフトウェアは，無保証で提供されているものである．上記著作権者お
 *  よびTOPPERSプロジェクトは，本ソフトウェアに関して，その適用可能性も
 *  含めて，いかなる保証も行わない．また，本ソフトウェアの利用により直
 *  接的または間接的に生じたいかなる損害に関しても，その責任を負わない．
 * 
 *  @(#) $Id: kendryte-k210.h 2246 2019-10-10 20:23:15Z roi $
 */

#ifndef _KENDRYTE_K210_H_
#define _KENDRYTE_K210_H_

#include <sil.h>
#include "encoding.h"

#define TMAX_INTNO          66
#define TMAX_PRIORITY       8

/*
 *  割込み優先度設定のための定義
 */
#define TIRQ_NMI           (-8)		/* ノンマスカブル割込み */
#define TIRQ_LEVEL7        (-7)		/* 割込みレベル7 */
#define TIRQ_LEVEL6        (-6)		/* 割込みレベル6 */
#define TIRQ_LEVEL5        (-5)		/* 割込みレベル5 */
#define TIRQ_LEVEL4        (-4)		/* 割込みレベル4 */
#define TIRQ_LEVEL3        (-3)		/* 割込みレベル3 */
#define TIRQ_LEVEL2        (-2)		/* 割込みレベル2 */
#define TIRQ_LEVEL1        (-1)		/* 割込みレベル1 */

/*
 *  MACHINE EXCEPTION NUMBER
 */
#define EXC_INSTRUCTION_ADDRESS_MISALIGNED  0
#define EXC_INSTRUCTION_ADDRESS_FAULT       1
#define EXC_ILLEGAL_INSTRUCTION             2
#define EXC_BREAKPOINT                      3
#define EXC_LOAD_ADDRESS_MISALIGNED         4
#define EXC_LOAD_ADDRESS_FAULT              5
#define EXC_STORE_AMO_ADDRESS_MISALIGNED    6
#define EXC_STORE_AMO_ACCESS_FAUT           7
#define EXC_ENVIRONMENT_CALL_FROM_MMODE     11

/*
 *  MACHINE INTERRUPT NUMBER
 */
#define IRQ_MACHINE_SOFTWARE                3
#define IRQ_MACHIE_TIMER                    7
#define IRQ_MACHINE_EXTERNAL                11

/*
 *  GLOBAL INTERRUPT NUMBER
 */
#define IRQ_VECTOR_RESERVED                 0
#define IRQ_VECTOR_SPI0                     1	/* SPI0 interrupt */
#define IRQ_VECTOR_SPI1                     2	/* SPI1 interrupt */
#define IRQ_VECTOR_SPI_SLAVE                3	/* SPI_SLAVE interrupt */
#define IRQ_VECTOR_SPI3                     4	/* SPI3 interrupt */
#define IRQ_VECTOR_I2S0                     5	/* I2S0 interrupt */
#define IRQ_VECTOR_I2S1                     6	/* I2S1 interrupt */
#define IRQ_VECTOR_I2S2                     7	/* I2S2 interrupt */
#define IRQ_VECTOR_I2C0                     8	/* I2C0 interrupt */
#define IRQ_VECTOR_I2C1                     9	/* I2C1 interrupt */
#define IRQ_VECTOR_I2C2                     10	/* I2C2 interrupt */
#define IRQ_VECTOR_UART1                    11	/* UART1 interrupt */
#define IRQ_VECTOR_UART2                    12	/* UART2 interrupt */
#define IRQ_VECTOR_UART3                    13	/* UART3 interrupt */
#define IRQ_VECTOR_TIMER0A                  14	/* TIMER0 channel 0 or 1 interrupt */
#define IRQ_VECTOR_TIMER0B                  15	/* TIMER0 channel 2 or 3 interrupt */
#define IRQ_VECTOR_TIMER1A                  16	/* TIMER1 channel 0 or 1 interrupt */
#define IRQ_VECTOR_TIMER1B                  17	/* TIMER1 channel 2 or 3 interrupt */
#define IRQ_VECTOR_TIMER2A                  18	/* TIMER2 channel 0 or 1 interrupt */
#define IRQ_VECTOR_TIMER2B                  19	/* TIMER2 channel 2 or 3 interrupt */
#define IRQ_VECTOR_RTC                      20	/* RTC tick and alarm interrupt */
#define IRQ_VECTOR_WDT0                     21	/* Watching dog timer0 interrupt */
#define IRQ_VECTOR_WDT1                     22	/* Watching dog timer1 interrupt */
#define IRQ_VECTOR_APB_GPIO                 23	/* APB GPIO interrupt */
#define IRQ_VECTOR_DVP                      24	/* Digital video port interrupt */
#define IRQ_VECTOR_AI                       25	/* AI accelerator interrupt */
#define IRQ_VECTOR_FFT                      26	/* FFT accelerator interrupt */
#define IRQ_VECTOR_DMA0                     27	/* DMA channel0 interrupt */
#define IRQ_VECTOR_DMA1                     28	/* DMA channel1 interrupt */
#define IRQ_VECTOR_DMA2                     29	/* DMA channel2 interrupt */
#define IRQ_VECTOR_DMA3                     30	/* DMA channel3 interrupt */
#define IRQ_VECTOR_DMA4                     31	/* DMA channel4 interrupt */
#define IRQ_VECTOR_DMA5                     32	/* DMA channel5 interrupt */
#define IRQ_VECTOR_UARTHS                   33	/* Hi-speed UART0 interrupt */
#define IRQ_VECTOR_GPIOHS0                  34	/* Hi-speed GPIO0 interrupt */
#define IRQ_VECTOR_GPIOHS1                  35	/* Hi-speed GPIO1 interrupt */
#define IRQ_VECTOR_GPIOHS2                  36	/* Hi-speed GPIO2 interrupt */
#define IRQ_VECTOR_GPIOHS3                  37	/* Hi-speed GPIO3 interrupt */
#define IRQ_VECTOR_GPIOHS4                  38	/* Hi-speed GPIO4 interrupt */
#define IRQ_VECTOR_GPIOHS5                  39	/* Hi-speed GPIO5 interrupt */
#define IRQ_VECTOR_GPIOHS6                  40	/* Hi-speed GPIO6 interrupt */
#define IRQ_VECTOR_GPIOHS7                  41	/* Hi-speed GPIO7 interrupt */
#define IRQ_VECTOR_GPIOHS8                  42	/* Hi-speed GPIO8 interrupt */
#define IRQ_VECTOR_GPIOHS9                  43	/* Hi-speed GPIO9 interrupt */
#define IRQ_VECTOR_GPIOHS10                 44	/* Hi-speed GPIO10 interrupt */
#define IRQ_VECTOR_GPIOHS11                 45	/* Hi-speed GPIO11 interrupt */
#define IRQ_VECTOR_GPIOHS12                 46	/* Hi-speed GPIO12 interrupt */
#define IRQ_VECTOR_GPIOHS13                 47	/* Hi-speed GPIO13 interrupt */
#define IRQ_VECTOR_GPIOHS14                 48	/* Hi-speed GPIO14 interrupt */
#define IRQ_VECTOR_GPIOHS15                 49	/* Hi-speed GPIO15 interrupt */
#define IRQ_VECTOR_GPIOHS16                 50	/* Hi-speed GPIO16 interrupt */
#define IRQ_VECTOR_GPIOHS17                 51	/* Hi-speed GPIO17 interrupt */
#define IRQ_VECTOR_GPIOHS18                 52	/* Hi-speed GPIO18 interrupt */
#define IRQ_VECTOR_GPIOHS19                 53	/* Hi-speed GPIO19 interrupt */
#define IRQ_VECTOR_GPIOHS20                 54	/* Hi-speed GPIO20 interrupt */
#define IRQ_VECTOR_GPIOHS21                 55	/* Hi-speed GPIO21 interrupt */
#define IRQ_VECTOR_GPIOHS22                 56	/* Hi-speed GPIO22 interrupt */
#define IRQ_VECTOR_GPIOHS23                 57	/* Hi-speed GPIO23 interrupt */
#define IRQ_VECTOR_GPIOHS24                 58	/* Hi-speed GPIO24 interrupt */
#define IRQ_VECTOR_GPIOHS25                 59	/* Hi-speed GPIO25 interrupt */
#define IRQ_VECTOR_GPIOHS26                 60	/* Hi-speed GPIO26 interrupt */
#define IRQ_VECTOR_GPIOHS27                 61	/* Hi-speed GPIO27 interrupt */
#define IRQ_VECTOR_GPIOHS28                 62	/* Hi-speed GPIO28 interrupt */
#define IRQ_VECTOR_GPIOHS29                 63	/* Hi-speed GPIO29 interrupt */
#define IRQ_VECTOR_GPIOHS30                 64	/* Hi-speed GPIO30 interrupt */
#define IRQ_VECTOR_GPIOHS31                 65	/* Hi-speed GPIO31 interrupt */


