YutakaMatsubara/toppers-asp_riscv/target/k210_gcc/kendryte-k210.h
/* Under APB1 32 bit */
#define GPIO_BASE_ADDR          0x50200000UL
#define UART1_BASE_ADDR         0x50210000UL
#define SPI_SLAVE_BASE_ADDR     0x50240000UL
#define I2S0_BASE_ADDR          0x50250000UL
#define I2S1_BASE_ADDR          0x50260000UL
#define I2S2_BASE_ADDR          0x50270000UL
#define I2C0_BASE_ADDR          0x50280000UL
#define I2C1_BASE_ADDR          0x50290000UL
#define I2C2_BASE_ADDR          0x502A0000UL
#define FPIOA_BASE_ADDR         0x502B0000UL
#define SHA256_BASE_ADDR        0x502C0000UL
#define TIMER0_BASE_ADDR        0x502D0000UL
#define TIMER1_BASE_ADDR        0x502E0000UL
#define TIMER2_BASE_ADDR        0x502F0000UL

/* Under APB2 32 bit */
#define WDT0_BASE_ADDR          0x50400000UL
#define WDT1_BASE_ADDR          0x50410000UL
#define OTP_BASE_ADDR           0x50420000UL
#define DVP_BASE_ADDR           0x50430000UL
#define SYSCTL_BASE_ADDR        0x50440000UL
#define AES_BASE_ADDR           0x50450000UL
#define RTC_BASE_ADDR           0x50460000UL


/* Under APB3 32 bit */
#define SPI0_BASE_ADDR          0x52000000UL
#define SPI1_BASE_ADDR          0x53000000UL
#define SPI3_BASE_ADDR          0x54000000UL


/*
 *  CLINT (64bits registers)
 */
#define TADR_CLIC_BASE      (CLINT_BASE_ADDR)
#define TOFF_CLINT_MSIP     0x0000			/* (RW) MSIP Registers 4bytes */
  #define CLINT_MSOFTIP       0x000000001	/* Machine-mode software interrupt */
#define TOFF_CLINT_MTIMECMP 0x4000			/* (RW) Timer compare Registers Machine-mode timer interrupts 8bytes */
#define TOFF_CLINT_MTIME    0xBFF8			/* (R)  Timer Registers 8bytes */

#define CLINT_MAX_CORES     (4095)


/*
 *  PLIC
 */
#define TADR_PLIC_BASE      (PLIC_BASE_ADDR)
#define TOFF_PLIC_PRIORITY  0x00000000
#define TOFF_PLIC_PENDING   0x00001000
#define TOFF_PLIC_ENABLE    0x00002000
#define NUM_PLIC_ENABLE     1024
#define TOFF_PLIC_THRESHOLD 0x00200000
#define NUM_PLIC_THRESHOLD  4096
#define TOFF_PLIC_CLAIM     0x00200004


/*
 *  DMAC (64bits registers)
 */
#define TADR_DMAC_BASE      (DMAC_BASE_ADDR)
#define TOFF_DMAC_ID                0x0000	/* (R)  DMAC ID Rgister */
#define TOFF_DMAC_COMPVER           0x0008	/* (R)  DMAC COMPVER Register */
#define TOFF_DMAC_CFG               0x0010	/* (RW) DMAC Configure Register */
  #define DMAC_CFG_DMAC_EN              0x00000001L	/* enable dmac(dmac_en) */
  #define DMAC_CFG_INT_EN               0x00000002L	/* glabally enable interrupt generation(int_en) */
#define TOFF_DMAC_CHEN              0x0018	/* (RW) Channel Enable Register */
  #define DMAC_CHEN_CH1_EN              0x0000000000000001	 /* enable channel 1(ch1_en) */
  #define DMAC_CHEN_CH2_EN              0x0000000000000002	 /* enable channel 2(ch2_en) */
  #define DMAC_CHEN_CH3_EN              0x0000000000000004	 /* enable channel 3(ch3_en) */
  #define DMAC_CHEN_CH4_EN              0x0000000000000008	 /* enable channel 4(ch4_en) */
  #define DMAC_CHEN_CH5_EN              0x0000000000000010	 /* enable channel 5(ch5_en) */
  #define DMAC_CHEN_CH6_EN              0x0000000000000020	 /* enable channel 6(ch6_en) */
  #define DMAC_CHEN_CH1_EN_WE           0x0000000000000100	 /* write enable bit channel 1(ch1_en_we) */
  #define DMAC_CHEN_CH2_EN_WE           0x0000000000000200	 /* write enable bit channel 2(ch2_en_we) */
  #define DMAC_CHEN_CH3_EN_WE           0x0000000000000400	 /* write enable bit channel 3(ch3_en_we) */
  #define DMAC_CHEN_CH4_EN_WE           0x0000000000000800	 /* write enable bit channel 4(ch4_en_we) */
  #define DMAC_CHEN_CH5_EN_WE           0x0000000000001000	 /* write enable bit channel 5(ch5_en_we) */
  #define DMAC_CHEN_CH6_EN_WE           0x0000000000002000	 /* write enable bit channel 6(ch6_en_we) */
  #define DMAC_CHEN_CH1_SUSP            0x0000000000010000	 /* susped reuest channel 1(ch1_susp) */
  #define DMAC_CHEN_CH2_SUSP            0x0000000000020000	 /* susped reuest channel 2(ch2_susp) */
  #define DMAC_CHEN_CH3_SUSP            0x0000000000040000	 /* susped reuest channel 3(ch3_susp) */
  #define DMAC_CHEN_CH4_SUSP            0x0000000000080000	 /* susped reuest channel 4(ch4_susp) */
  #define DMAC_CHEN_CH5_SUSP            0x0000000000100000	 /* susped reuest channel 5(ch5_susp) */
  #define DMAC_CHEN_CH6_SUSP            0x0000000000200000	 /* susped reuest channel 6(ch6_susp) */
  #define DMAC_CHEN_CH1_SUSP_WE         0x0000000001000000	 /* swrite enable to the channel 1 suspend(ch1_susp_we) */
  #define DMAC_CHEN_CH2_SUSP_WE         0x0000000002000000	 /* swrite enable to the channel 2 suspend(ch2_susp_we) */
  #define DMAC_CHEN_CH3_SUSP_WE         0x0000000004000000	 /* swrite enable to the channel 3 suspend(ch3_susp_we) */
  #define DMAC_CHEN_CH4_SUSP_WE         0x0000000008000000	 /* swrite enable to the channel 4 suspend(ch4_susp_we) */
  #define DMAC_CHEN_CH5_SUSP_WE         0x0000000010000000	 /* swrite enable to the channel 5 suspend(ch5_susp_we) */
  #define DMAC_CHEN_CH6_SUSP_WE         0x0000000020000000	 /* swrite enable to the channel 6 suspend(ch6_susp_we) */
  #define DMAC_CHEN_CH1_ABOUT           0x0000000100000000	 /* channel-1 abort requst bit(ch1_abort) */
  #define DMAC_CHEN_CH2_ABOUT           0x0000000200000000	 /* channel-2 abort requst bit(ch2_abort) */
  #define DMAC_CHEN_CH3_ABOUT           0x0000000400000000	 /* channel-3 abort requst bit(ch3_abort) */
  #define DMAC_CHEN_CH4_ABOUT           0x0000000800000000	 /* channel-4 abort requst bit(ch4_abort) */
  #define DMAC_CHEN_CH5_ABOUT           0x0000001000000000	 /* channel-5 abort requst bit(ch5_abort) */
  #define DMAC_CHEN_CH6_ABOUT           0x0000002000000000	 /* channel-6 abort requst bit(ch6_abort) */
  #define DMAC_CHEN_CH1_ABOUT_WE        0x0000010000000000	 /* write enable  channel-1 abort bit(ch1_abort_we) */
  #define DMAC_CHEN_CH2_ABOUT_WE        0x0000020000000000	 /* write enable  channel-2 abort bit(ch2_abort_we) */
  #define DMAC_CHEN_CH3_ABOUT_WE        0x0000040000000000	 /* write enable  channel-3 abort bit(ch3_abort_we) */
  #define DMAC_CHEN_CH4_ABOUT_WE        0x0000080000000000	 /* write enable  channel-4 abort bit(ch4_abort_we) */
  #define DMAC_CHEN_CH5_ABOUT_WE        0x0000100000000000	 /* write enable  channel-5 abort bit(ch5_abort_we) */
  #define DMAC_CHEN_CH6_ABOUT_WE        0x0000200000000000	 /* write enable  channel-6 abort bit(ch6_abort_we) */
#define TOFF_DMAC_INTSTATUS         0x0030	/* (RW) DMAC Interrupt Status Register */
  #define DMAC_INTSTATUS_CH1            0x00000001L	 /* channel 1 interrupt bit(ch1_intstat) */
  #define DMAC_INTSTATUS_CH2            0x00000002L	 /* channel 2 interrupt bit(ch2_intstat) */
  #define DMAC_INTSTATUS_CH3            0x00000004L	 /* channel 3 interrupt bit(ch3_intstat) */
  #define DMAC_INTSTATUS_CH4            0x00000008L	 /* channel 4 interrupt bit(ch4_intstat) */
  #define DMAC_INTSTATUS_CH5            0x00000010L	 /* channel 5 interrupt bit(ch5_intstat) */
  #define DMAC_INTSTATUS_CH6            0x00000020L	 /* channel 6 interrupt bit(ch6_intstat) */
#define TOFF_DMAC_COM_INTCLEAR      0x0038	/* (RW) DMAC Common register Interrupt Status Register */
  #define DMAC_COM_INTCLEAR_SLVIF_DEC_ERR           0x00000001L	/* Slave Interface Common Register Decode Error Interrupt Status clear(clear_slvif_dec_err_intstat) */
  #define DMAC_COM_INTCLEAR_SLVIF_WR2RO_ERR         0x00000002L	/* Slave Interface Common Register Write to Read only Error Interrupt Status clear(clear_slvif_wr2ro_err_intstat) */
  #define DMAC_COM_INTCLEAR_SLVIF_RD2WO_ERR         0x00000004L	/* Slave Interface Common Register Read to Write only Error Interrupt Status clear(clear_slvif_rd2wo_err_intstat) */
  #define DMAC_COM_INTCLEAR_SLVIF_WRONHOLD_ERR      0x00000008L	/* Slave Interface Common Register Write On Hold Error Interrupt Status clear(clear_slvif_wronhold_err_intstat) */
  #define DMAC_COM_INTCLEAR_SLVIF_UNDEFREG_ERR      0x00000100L	/* Slave Interface Undefined register Decode Error Interrupt Status clear(clear_slvif_undefinedreg_dec_err_intstat) */
#define TOFF_DMAC_COM_INTSTATUS_EN  0x0040	/* (RW) DMAC Common Interrupt Enable Register */
  #define DMAC_COM_INTSTATUS_EN_SLVIF_DEC_ERR       0x00000001L	/* Slave Interface Common Register Decode Error Interrupt Status Enable(enable_slvif_dec_err_intstat) */
  #define DMAC_COM_INTSTATUS_EN_SLVIF_WR2RO_ERR     0x00000002L	/* Slave Interface Common Register Write to Read only Error Interrupt Status Enable(enable_slvif_wr2ro_err_intstat) */
  #define DMAC_COM_INTSTATUS_EN_SLVIF_RD2WO_ERR     0x00000004L	/* Slave Interface Common Register Read to Write only Error Interrupt Status Enable(enable_slvif_rd2wo_err_intstat) */
  #define DMAC_COM_INTSTATUS_EN_SLVIF_WRONHOLD_ERR  0x00000008L	/* Slave Interface Common Register Write On Hold Error Interrupt Status Enable(enable_slvif_wronhold_err_intstat) */
  #define DMAC_COM_INTSTATUS_EN_SLVIF_UNDEFREG_ERR  0x00000100L	/* Slave Interface Undefined register Decode Error Interrupt Status Enable(enable_slvif_undefinedreg_dec_err_intstat) */
#define TOFF_DMAC_COM_INTSIGNAL_EN  0x0048	/* (RW) DMAC Common Interrupt Signal Enable Register */
  #define DMAC_COM_INTSIGNAL_EN_SLVIF_DEC_ERR       0x00000001L	/* Slave Interface Common Register Decode Error Interrupt Signal Enable(enable_slvif_dec_err_intsignal) */
  #define DMAC_COM_INTSIGNAL_EN_SLVIF_WR2RO_ERR     0x00000002L	/* Slave Interface Common Register Write to Read only Error Interrupt Signal Enable(enable_slvif_wr2ro_err_intsignal) */
  #define DMAC_COM_INTSIGNAL_EN_SLVIF_RD2WO_ERR     0x00000004L	/* Slave Interface Common Register Read to Write only Error Interrupt Signal Enable(enable_slvif_rd2wo_err_intsignal) */
  #define DMAC_COM_INTSIGNAL_EN_SLVIF_WRONHOLD_ERR  0x00000008L	/* Slave Interface Common Register Write On Hold Error Interrupt Signal Enable(enable_slvif_wronhold_err_intsignal) */
  #define DMAC_COM_INTSIGNAL_EN_SLVIF_UNDEFREG_ERR  0x00000100L	/* Slave Interface Undefined register Decode Error Interrupt Signal Enable(enable_slvif_undefinedreg_dec_err_intsignal) */
#define TOFF_DMAC_COM_INTSTATUS     0x0050	/* (RW) DMAC Common Interrupt Status */
  #define DMAC_COM_INTSTATUS_SLVIF_DEC_ERR          0x00000001L	/* Slave Interface Common Register Decode(slvif_dec_err_intstat) */
  #define DMAC_COM_INTSTATUS_SLVIF_WR2RO_ERR        0x00000002L	/* Slave Interface Common Register Write to Read Only(slvif_wr2ro_err_intstat */
  #define DMAC_COM_INTSTATUS_SLVIF_RD2WO_ERR        0x00000004L	/* Slave Interface Common Register Read to Write(slvif_rd2wo_err_intstat) */
  #define DMAC_COM_INTSTATUS_SLVIF_WRONHOLD_ERR     0x00000008L	/*Slave Interface Common Register Write On(slvif_wronhold_err_intstat) */
  #define DMAC_COM_INTSTATUS_SLVIF_UNDEFREG_ERR     0x00000100L	/*Slave Interface Undefined register Decode Error(slvif_undefinedreg_dec_err_intstat) */
#define TOFF_DMAC_RESET             0x0058	/* (RW) DMAC Reset register */
  #define DMAC_RESET_RST                0x00000001L	/* DMAC reset request bit */
#define TOFF_DMAC_CHANNEL           0x0100	/* (RW) DMAC channel registers */

