YutakaMatsubara/toppers-asp_riscv/target/k210_gcc/kendryte-k210.h
/*
 *  DMAC CHANNEL WINDOW
 */
#define TOFF_DMAC_CH_SAR            0x0000	/* (RW) SAR Address Register */
#define TOFF_DMAC_CH_DAR            0x0008	/* (RW) DAR Address Register */
#define TOFF_DMAC_CH_BLOCK_TS       0x0010	/* (RW) Block Transfer Size Register */
  #define DMACCH_BLOCK_TS               0x03FFFFFFL	/* block transfer size(block_ts) */
#define TOFF_DMAC_CH_CTL            0x0018	/* (RW) Control Register */
  #define DMACCH_CTL_SMS                0x0000000000000001	/* source master select(sms) */
  #define DMACCH_CTL_DMS                0x0000000000000004	/* destination master select(dms) */
  #define DMACCH_CTL_SINC               0x0000000000000010	/* source address increment(sinc) */
  #define DMACCH_CTL_DINC               0x0000000000000040	/* destination address incremnet(dinc) */
  #define DMACCH_CTL_SRC_TR_WIDTH       0x0000000000000700	/* source transfer width(src_tr_width) */
  /* * 0x0 for source transfer width is 8 bits
     * 0x1 for source transfer width is 16 bits
     * 0x2 for source transfer width is 32 bits
     * 0x3 for source transfer width is 64 bits
     * 0x4 for source transfer width is 128 bits
     * 0x5  for source transfer width is 256 bits
     * 0x6 for source transfer width is 512 bits
     */
  #define DMACCH_CTL_DST_TR_WIDTH       0x0000000000003800	/* detination transfer width(dst_tr_width) */
  /* * 0x0 for detination transfer width is 8 bits
     * 0x1 for detination transfer width is 16 bits
     * 0x2 for detination transfer width is 32 bits
     * 0x3 for detination transfer width is 64 bits
     * 0x4 for detination transfer width is 128 bits
     * 0x5  for detination transfer width is 256 bits
     * 0x6 for detination transfer width is 512 bits
     */
  #define DMACCH_CTL_SRC_MSIZE          0x000000000003C000	/* source burst transaction length(src_msize) */
  /* * 0x0 for 1 data item read from rource in the burst transaction
     * 0x1 for 4 data item read from rource in the burst transaction
     * 0x2 for 8 data item read from rource in the burst transaction
     * 0x3 for 16 data item read from rource in the burst transaction
     * 0x4 for 32 data item read from rource in the burst transaction
     * 0x5 for 64 data item read from rource in the burst transaction
     * 0x6 for 128 data item read from rource in the burst transaction
     * 0x7 for 256 data item read from rource in the burst transaction
     * 0x8 for 512 data item read from rource in the burst transaction
     * 0x9 for 1024 data item read from rource in the burst transaction
     */
  #define DMACCH_CTL_DST_MSIZE          0x00000000003C0000	/* destination burst transaction length(dst_msize) */
  /* * 0x0 for 1 data item read from rource in the burst transaction
     * 0x1 for 4 data item read from rource in the burst transaction
     * 0x2 for 8 data item read from rource in the burst transaction
     * 0x3 for 16 data item read from rource in the burst transaction
     * 0x4 for 32 data item read from rource in the burst transaction
     * 0x5 for 64 data item read from rource in the burst transaction
     * 0x6 for 128 data item read from rource in the burst transaction
     * 0x7 for 256 data item read from rource in the burst transaction
     * 0x8 for 512 data item read from rource in the burst transaction
     * 0x9 for 1024 data item read from rource in the burst transaction
     */
  #define DMACCH_CTL_NONP_LASTWRITE_EN  0x0000000040000000	/* Non Posted Last Write Enable(nonposted_lastwrite_en) */
  #define DMACCH_CTL_ARLEN_EN           0x0000004000000000	/* source burst length enable(arlen_en) */
  #define DMACCH_CTL_ARLEN              0x00007F1000000000	/* source burst length(arlen) */
  #define DMACCH_CTL_AWLEN_EN           0x0000800000000000	/* destination burst length enable(awlen_en) */
  #define DMACCH_CTL_AWLEN              0x00FF000000000000	/* destination burst length(awlen) */
  #define DMACCH_CTL_SRC_STAT_EN        0x0100000000000000	/* source status enable(src_stat_en) */
  #define DMACCH_CTL_DST_STAT_EN        0x0200000000000000	/* destination status enable(dst_stat_en) */
  #define DMACCH_CTL_IOC_BLKTFR         0x0400000000000000	/* interrupt completion of block transfer(ioc_blktfr) */
  #define DMACCH_CTL_SHREG_OR_LLI_LAST  0x4000000000000000	/* last shadow linked list item(shadowreg_or_lli_last) */
  #define DMACCH_CTL_SHREG_OR_LLI_VALID 0x8000000000000000	/* last shadow linked list item valid(shadowreg_or_lli_valid) */
#define TOFF_DMAC_CH_CFG            0x0020	/* (RW) Configure Register */
  #define DMACCH_CFG_SRC_MULTBLKTYPE    0x0000000000000003	/* source multi block transfer type(src_multblk_type) */
  /* * 0x0 for continuous multiblock type
     * 0x1 for reload multiblock type
     * 0x2 for shadow register based multiblock type
     * 0x3 for linked lisr bases multiblock type
     */
  #define DMACCH_CFG_DST_MULTBLKTYPE    0x000000000000000C	/* destination multi block transfer type(dst_multblk_type) */
  /* * 0x0 for continuous multiblock type
     * 0x1 for reload multiblock type
     * 0x2 for shadow register based multiblock type
     * 0x3 for linked lisr bases multiblock type
     */
  #define DMACCH_CFG_TT_FC              0x0000000700000000	/* transfer type and flow control(tt_fc) */
  /* * 0x0  transfer memory to memory and flow controler is dmac
     * 0x1  transfer memory to peripheral and flow controler is dmac
     * 0x2  transfer peripheral to memory and flow controler is dmac
     * 0x3  transfer peripheral to peripheral and flow controler is dmac
     * 0x4  transfer peripheral to memory and flow controler is
     * source peripheral
     * 0x5  transfer peripheral to peripheral and flow controler
     * is source peripheral
     * 0x6  transfer memory to peripheral and flow controler is
     * destination peripheral
     * 0x7  transfer peripheral to peripheral and flow controler
     * is destination peripheral
     */
  #define DMACCH_CFG_HS_SEL_SRC         0x0000000800000000	/* source software or hardware handshaking select(hs_sel_src) */
  #define DMACCH_CFG_HS_SEL_DST         0x0000001000000000	/* destination software or hardware handshaking select(hs_sel_dst) */
  #define DMACCH_CFG_SRC_HWHS_POL       0x0000002000000000	/* sorce hardware handshaking interface polarity(src_hwhs_pol) */
  #define DMACCH_CFG_DST_HWHS_POL       0x0000004000000000	/* destination hardware handshaking interface polarity(dst_hwhs_pol) */
  #define DMACCH_CFG_SRC_PER            0x0000078000000000	/* assign a hardware handshaking interfaceto source of channel x(src_per) */
  #define DMACCH_CFG_DST_PER            0x0000F00000000000	/* assign a hardware handshaking interfaceto destination of channel x(dst_per) */
  #define DMACCH_CFG_CH_PRIOR           0x000E000000000000	/* channel priority,7 is highest, 0 is lowest(ch_prior) */
  #define DMACCH_CFG_LOCK_CH            0x0010000000000000	/* channel lock bit(lock_ch) */
  #define DMACCH_CFG_LOCK_CH_L          0x0060000000000000	/* channel lock level(lock_ch_l) */
  #define DMACCH_CFG_SRC_OSR_LMT        0x0780000000000000	/* source outstanding request limit(src_osr_lmt) */
  #define DMACCH_CFG_DST_OSR_LMT        0x7800000000000000	/* destination outstanding request limit(dst_osr_lmt) */
#define TOFF_DMAC_CH_LLP            0x0028	/* (RW) Linked List Pointer register */
  #define DMACCH_LLP_LMS                0x0000000000000001	/* LLI master select(lms) */
  #define DMACCH_LLP_LOC                0xFFFFFFFFFFFFFFC0	/* starting address memeory of LLI block(loc) */
#define TOFF_DMAC_CH_STATUS         0x0030	/* (RW) Channelx Status Register */
  #define DMACCH_CMPLTD_BLK_SIZE        0x03FFFFFFL	/* completed block transfer size(cmpltd_blk_size) */
#define TOFF_DMAC_CH_SWHSSRC        0x0038	/* (RW) Channelx Software handshake Source Register */
  #define DMACCH_SWHS_REQ_SRC           0x00000001L	/* software handshake request for channel source(swhs_req_src) */
  #define DMACCH_SWHS_REQ_SRC_WE        0x00000002L	/* write enable bit for software handshake request(swhs_req_src_we) */
  #define DMACCH_SWHS_SGLREQ_SRC        0x00000004L	/* software handshake single request for channel source(swhs_sglreq_src) */
  #define DMACCH_SWHS_SGLREQ_SRC_WE     0x00000008L	/* write enable bit for software handshake single request for channle source(swhs_sglreq_src_we) */
  #define DMACCH_SWHS_LST_SRC           0x00000010L	/* software handshake last request for channel source(swhs_lst_src) */
  #define DMACCH_SWHS_LST_SRC_WE        0x00000020L	/* write enable bit for software handshake last request(swhs_lst_src_we) */
#define TOFF_DMAC_CH_SWHSDST        0x0040	/* (RW) Channelx Software handshake Destination Register */
  #define DMACCH_SWHS_REQ_DST           0x00000001L	/* software handshake request for channel destination(swhs_req_dst) */
  #define DMACCH_SWHS_REQ_DST_WE        0x00000002L	/* write enable bit for software handshake request(swhs_req_dst_we) */
  #define DMACCH_SWHS_SGLREQ_DST        0x00000004L	/* software handshake single request for channel destination(swhs_sglreq_dst) */
  #define DMACCH_SWHS_SGLREQ_DST_WE     0x00000008L	/* write enable bit for software handshake single request for channle destination(swhs_sglreq_dst_we) */
  #define DMACCH_SWHS_LST_DST           0x00000010L	/* software handshake last request for channel destination(swhs_lst_dst) */
  #define DMACCH_SWHS_LST_DST_WE        0x00000020L	/* write enable bit for software handshake last request(swhs_lst_dst_we) */
#define TOFF_DMAC_CH_BLK_TFR        0x0048	/* (RW) Channelx Block Transfer Resume Request Register */
  #define DMACCH_BLK_TFR_RESUMEREQ      0x00000001L	/* block transfer resume request bit */
#define TOFF_DMAC_CH_AXI_ID         0x0050	/* (R)  Channelx AXI ID Register */
#define TOFF_DMAC_CH_AXI_QOS        0x0058	/* (RW) Channelx AXI QOS Register */
#define TOFF_DMAC_CH_INTSTATUS_EN   0x0080	/* (RW) Interrupt Status Enable Register */
  #define DMACCH_ENABLE_BLOCK_TFR_DONE_INTSTAT 0x00000001L	/* block transfer done interrupt status enable(enable_block_tfr_done_intstatus) */
  #define DMACCH_ENABLE_DMA_TFR_DONE_INTSTAT   0x00000002L	/* DMA transfer done interrupt status enable(enable_dma_tfr_done_intstat) */
  #define DMACCH_ENABLE_SRC_TRANSCOMP_INTSTAT  0x00000008L	/* source transaction complete status enable(enable_src_transcomp_intstat) */
  #define DMACCH_ENABLE_DST_TRANSCOMP_INSTAT   0x00000010L	/* destination transaction complete(enable_dst_transcomp_intstat) */
  #define DMACCH_ENABLE_SRC_DEC_ERR_INSTAT     0x00000020L	/* Source Decode Error Status Enable(enable_src_dec_err_intstat) */
  #define DMACCH_ENABLE_DST_DEC_ERR_INSTAT     0x00000040L	/* Destination Decode Error Status Enable(enable_dst_dec_err_intstat) */
  #define DMACCH_ENABLE_SRC_SLV_ERR_INSTAT     0x00000080L	/* Source Slave Error Status Enable(enable_src_slv_err_intstat) */
  #define DMACCH_ENABLE_DST_SLV_ERR_INSTAT     0x00000100L	/* Destination Slave Error Status Enable(enable_dst_slv_err_intstat) */
  #define DMACCH_ENABLE_LLI_RD_DEC_ERR_INSTAT  0x00000200L	/* LLI Read Decode Error Status Enable(enable_lli_rd_dec_err_intstat) */
  #define DMACCH_ENABLE_LLI_WR_DEC_ERR_INSTAT  0x00000400L	/* LLI WRITE Decode Error Status Enable(enable_lli_wr_dec_err_intstat) */
  #define DMACCH_ENABLE_LLI_RD_SLV_ERR_INSTAT  0x00000800L	/* LLI Read Slave Error Status Enable(enable_lli_rd_slv_err_intstat) */
  #define DMACCH_ENABLE_LLI_WR_SLV_ERR_INSTAT  0x00001000L	/* LLI WRITE Slave Error Status Enable(enable_lli_wr_slv_err_intstat) */
#define TOFF_DMAC_CH_INTSTATUS      0x0088	/* (RW) Channelx Interrupt Status Register */
#define TOFF_DMAC_CH_INTSIGNAL_EN   0x0090	/* (RW) Interrupt  Siganl Enable Register */
#define TOFF_DMAC_CH_INTCLEAR       0x0098	/* (W)  Interrupt Clear Register */
  #define DMACCH_BLK_TFR_DONE_INSTAT    0x00000001L	/* block transfer done interrupt clear bit(blk_tfr_done_intstat) */
  #define DMACCH_DMA_TFR_DONE_INSTAT    0x00000002L	/* DMA transfer done interrupt clear bit(dma_tfr_done_intstat) */

#define DMAC_CHANNEL_WINDOW_SIZE    0x0100
#define NUM_DMAC_CHANNEL            6

