YutakaMatsubara/toppers-asp_riscv/target/k210_gcc/kendryte-k210.h
/*
 *  GPIOHS
 */
#define TADR_GPIOHS_BASE    (GPIOHS_BASE_ADDR)
#define TOFF_GPIOHS_INPUT_VAL   0x0000	/* (RW) Input Values */
#define TOFF_GPIOHS_INPUT_EN    0x0004	/* (RW) Input enable */
#define TOFF_GPIOHS_OUTPUT_EN   0x0008	/* (RW) Output enable */
#define TOFF_GPIOHS_OUTPUT_VAL  0x000C	/* (RW) Onput Values */
#define TOFF_GPIOHS_PULLUP_EN   0x0010	/* (RW) Internal Pull-Ups enable */
#define TOFF_GPIOHS_DRIVE       0x0014	/* (RW) Drive Strength */
#define TOFF_GPIOHS_RISE_IE     0x0018	/* (RW) Rise interrupt enable */
#define TOFF_GPIOHS_RISE_IP     0x001C	/* (RW) Rise interrupt pending */
#define TOFF_GPIOHS_FALL_IE     0x0020	/* (RW) Fall interrupt enable */
#define TOFF_GPIOHS_FALL_IP     0x0024	/* (RW) Fall interrupt pending */
#define TOFF_GPIOHS_HIGH_IE     0x0028	/* (RW) High interrupt enable */
#define TOFF_GPIOHS_HIGH_IP     0x002C	/* (RW) High interrupt pending */
#define TOFF_GPIOHS_LOW_IE      0x0030	/* (RW) Low interrupt enable */
#define TOFF_GPIOHS_LOW_IP      0x0034	/* (RW) Low interrupt pending */
#define TOFF_GPIOHS_IOF_EN      0x0038	/* (RW) HW I/O Function enable */
#define TOFF_GPIOHS_IOF_SEL     0x003C	/* (RW) HW I/O Function select */
#define TOFF_GPIOHS_OUTPOT_XOR  0x0040	/* (RW) Output XOR (invert) */

#define GPIOHS_MAX_PINNO        32


/*
 *  GPIO
 */
#define TADR_GPIO_BASE      (GPIO_BASE_ADDR)
#define TOFF_GPIO_DATA_OUTOUT     0x0000	/* (RW) Data (output) registers */
#define TOFF_GPIO_DIRECTION       0x0004	/* (RW) Data direction registers */
#define TOFF_GPIO_SOURCE          0x0008	/* (RW) Data source registers */
#define TOFF_GPIO_INT_ENABLE      0x0030	/* (RW) Interrupt enable/disable registers */
#define TOFF_GPIO_INT_MASK        0x0034	/* (RW) Interrupt mask registers */
#define TOFF_GPIO_INT_LEVEL       0x0038	/* (RW) Interrupt level registers */
#define TOFF_GPIO_INT_POLARITY    0x003C	/* (RW) Interrupt polarity registers */
#define TOFF_GPIO_INT_STATUS      0x0040	/* (RW) Interrupt status registers */
#define TOFF_GPIO_INT_STATUS_RAW  0x0044	/* (RW) Raw interrupt status registers */
#define TOFF_GPIO_INT_DEBOUNCE    0x0048	/* (RW) Interrupt debounce registers */
#define TOFF_GPIO_INT_CLEAR       0x004C	/* (RW) Registers for clearing interrupts */
#define TOFF_GPIO_DATA_INPUT      0x0050	/* (RW) External port (data input) registers */
#define TOFF_GPIO_SYNC_LEVEL      0x0060	/* (RW) Sync level registers */
#define TOFF_GPIO_ID_CODE         0x0064	/* (R)  ID code */
#define TOFF_GPIO_INT_BOTHEDGE    0x0068	/* (RW) Interrupt both edge type */

#define GPIO_MAX_PINNO            8


/*
 *  UART
 */
#define TADR_UART1_BASE     (UART1_BASE_ADDR)
#define TADR_UART2_BASE     (UART1_BASE_ADDR + 0x10000)
#define TADR_UART3_BASE     (UART1_BASE_ADDR + 0x20000)
#define TOFF_UART_RBR       0x0000
#define TOFF_UART_DLL       0x0000
#define TOFF_UART_THR       0x0000
#define TOFF_UART_DLH       0x0004
#define TOFF_UART_IER       0x0004
  #define UART_IER_RIE        0x000000001
  #define UART_IER_TIE        0x000000002
  #define UART_IER_THRE       0x000000080
#define TOFF_UART_FCR       0x0008
#define TOFF_UART_IIR       0x0008
  #define UART_IIR_SEND       0x000000002
  #define UART_IIR_RECEIVE    0x000000004
  #define UART_IIR_CTIMEOUT   0x00000000C
#define TOFF_UART_LCR       0x000C
  #define UART_LCR_DLN        0x000000003
  #define UART_LCR_STB        0x000000004
  #define UART_LCR_PARITY     0x000000008
  #define UART_LCR_PEVEN      0x000000010
  #define UART_LCR_DMD        0x000000080
#define TOFF_UART_MCR       0x0010
#define TOFF_UART_LSR       0x0014
  #define UART_LSR_RFL        0x000000001
  #define UART_LSR_TFL        0x000000020
#define TOFF_UART_MSR       0x0018
#define TOFF_UART_SCR       0x001C
#define TOFF_UART_LPDLL     0x0020
#define TOFF_UART_LPDLH     0x0024

#define TOFF_UART_SRBR      0x0030
#define TOFF_UART_STHR      0x0030

#define TOFF_UART_FAR       0x0070
#define TOFF_UART_TFR       0x0074
#define TOFF_UART_RFW       0x0078
#define TOFF_UART_USR       0x007C
#define TOFF_UART_TFL       0x0080
#define TOFF_UART_RFL       0x0084
#define TOFF_UART_SRR       0x0088
#define TOFF_UART_SRTS      0x008C
#define TOFF_UART_SBCR      0x0090
#define TOFF_UART_SDMAM     0x0094
#define TOFF_UART_SFE       0x0098
#define TOFF_UART_SRT       0x009C
#define TOFF_UART_STET      0x00A0
#define TOFF_UART_HTX       0x00A4
#define TOFF_UART_DMASA     0x00A8
#define TOFF_UART_TCR       0x00AC
#define TOFF_UART_DE_EN     0x00B0
#define TOFF_UART_RE_EN     0x00B4
#define TOFF_UART_DET       0x00B8
#define TOFF_UART_TAT       0x00BC
#define TOFF_UART_DLF       0x00C0
#define TOFF_UART_RAR       0x00C4
#define TOFF_UART_TAR       0x00C8
#define TOFF_UART_LCR_EXT   0x00CC
#define TOFF_UART_CPR       0x00F4
#define TOFF_UART_UCV       0x00F8
#define TOFF_UART_CTR       0x00FC


/*
 *  I2S
 */
#define TADR_I2S0_BASE      (I2S0_BASE_ADDR)
#define TADR_I2S1_BASE      (I2S0_BASE_ADDR+0x10000)
#define TADR_I2S2_BASE      (I2S0_BASE_ADDR+0x20000)
#define TOFF_I2S_IER            0x0000		/* (RW) I2S Enable Register */
#define TOFF_I2S_IRER           0x0004		/* (RW) I2S Receiver Block Enable Register */
#define TOFF_I2S_ITER           0x0008		/* (RW) I2S Transmitter Block Enable Register */
#define TOFF_I2S_CER            0x000C		/* (RW) Clock Enable Register */
  #define I2S_CER_CLKEN             0x00000001	/* clock generation enable/disable */
#define TOFF_I2S_CCR            0x0010		/* (RW) Clock Configuration Register */
  #define I2S_CCR_CLK_GATE          0x00000007	/* program  the gating of sclk */
  /* * 0x0 for clock gating is diable,
     * 0x1 for gating after 12 sclk cycles
     * 0x2 for gating after 16 sclk cycles
     * 0x3 for gating after 20 sclk cycles
     * 0x4 for gating after 24 sclk cycles
     */
  #define I2S_CCR_CLK_WORD_SIZE     0x00000018	/* the number of sclk cycles for which the word select line stayd in the left aligned or right aligned mode. */
  #define I2S_CCR_ALIGN_MODE        0x000000E0	/* alignment mode setting. */
  /* * 0x1 for standard i2s format
     * 0x2 for right aligned format
     * 0x4 for left aligned format
     */
  #define I2S_CCR_DMA_TX_EN         0x00000100	/* DMA transmit enable control */
  #define I2S_CCR_DMA_RX_EN         0x00000200	/* DMA receive enable control */
  #define I2S_CCR_DMA_DIVIED_16     0x00000400	/* split 32bit data to two 16 bit data and filled in left and right channel. Used with dma_tx_en or dma_rx_en */
  #define I2S_CCR_SIGN_EXPAND_EN    0x00000800
#define TOFF_I2S_RXFFR          0x0014		/* (RW) Receiver Block FIFO Reset Register */
#define TOFF_I2S_TXFFR          0x0018		/* (RW) Transmitter Block FIFO Reset Register */
#define TOFF_I2S_CHANNEL        0x0020		/* (RW) channel 0x40 * 4 */
#define TOFF_I2S_RXDMA          0x01C0		/* (RW) Receiver Block DMA Register */
#define TOFF_I2S_RRXDMA         0x01C4		/* (RW) Reset Receiver Block DMA Register */
#define TOFF_I2S_TXDMA          0x01C8		/* (RW) Transmitter Block DMA Register */
#define TOFF_I2S_RTXDMA         0x01CC		/* (RW) Reset Transmitter Block DMA Register */
#define TOFF_I2S_COMP_PARAM_2   0x01F0		/* (RW) Component Parameter Register 2 */
#define TOFF_I2S_COMP_PARAM_1   0x01F4		/* (RW) Component Parameter Register 1 */
#define TOFF_I2S_COMP_VERSION   0x01F8		/* (RW) I2S Component Version Register */
#define TOFF_I2S_COMP_TYPE      0x01FC		/* (RW) I2S Component Type Register */

