YutakaMatsubara/toppers-asp_riscv/target/k210_gcc/kendryte-k210.h
/*
 *  I2S CHANNEL WINDOW
 */
#define TOFF_I2SC_LEFT_RXTX     0x0000		/* (RW) Left  Receive or Left Transmit Register */
#define TOFF_I2SC_RIGHT_RXTX    0x0004		/* (RW) Right Receive or Right Transmit Register */
#define TOFF_I2SC_RER           0x0008		/* (RW) Receive Enable Register */
  #define I2SC_RER_RXCHENX          0x00000001	/* receive channel enable/disable */
#define TOFF_I2SC_TER           0x000C		/* (RW) Transmit Enable Register */
  #define I2SC_TER_TXCHENX          0x00000001	/* transmit channel enable/disable */
#define TOFF_I2SC_RCR           0x0010		/* (RW) Receive Configuration Register */
  #define I2SC_RCR_WLEN             0x00000007	/* program desired data resolution of receiver */
#define TOFF_I2SC_TCR           0x0014		/* (RW) Transmit Configuration Register */
  #define I2SC_TCR_WLEN             0x00000007	/* program desired data resolution of transmitter */
  /* * 0x0 for ignore the word length
     * 0x1 for 12-bit data resolution of the receiver/transmitter,
     * 0x2 for 16-bit data resolution of the receiver/transmitter,
     * 0x3 for 20-bit data resolution of the receiver/transmitter,
     * 0x4 for 24-bit data resolution of the receiver/transmitter,
     * 0x5 for 32-bit data resolution of the receiver/transmitter
     */
#define TOFF_I2SC_ISR           0x0018		/* (RW) Interrupt Status Register */
  #define I2SC_ISR_RXDA             0x00000001	/* status of receiver data avaliable interrupt */
  #define I2SC_ISR_RXFO             0x00000002	/* status of data overrun interrupt for rx channel */
  #define I2SC_ISR_TXFE             0x00000010	/* status of transmit empty triger interrupt */
  #define I2SC_ISR_TXFO             0x00000020	/* status of data overrun interrupt for the TX channel */
#define TOFF_I2SC_IMR           0x001C		/* (RW) Interrupt Mask Register */
  #define I2SC_IMR_RXDAM            0x00000001	/* mask RX FIFO data available interrupt */
  #define I2SC_IMR_RXFOM            0x00000002	/* mask RX FIFO overrun interrupt */
  #define I2SC_IMR_TXFEM            0x00000010	/* mask TX FIFO empty interrupt */
  #define I2SC_IMR_TXFOM            0x00000020	/* mask TX FIFO overrun interrupt */
#define TOFF_I2SC_ROR           0x0020		/* (RW) Receive Overrun Register */
  #define I2CS_ROR_RXCHO            0x00000001	/* read this bit to clear RX FIFO data overrun interrupt */
#define TOFF_I2SC_TOR           0x0024		/* (RW) Transmit Overrun Register */
  #define I2CS_TOR_TXCHO            0x00000001	/* read this bit to clear TX FIFO data overrun interrupt */
#define TOFF_I2SC_RFCR          0x0028		/* (RW) Receive FIFO Configuration Register */
  #define I2SC_RFCR_RXCHDT          0x0000000F	/* program the trigger level in the RX FIFO at which the receiver data available interrupt generate */
  /* * 0x0 for interrupt trigger when FIFO level is 1,
     * 0x2 for interrupt trigger when FIFO level is 2,
     * 0x3 for interrupt trigger when FIFO level is 4,
     * 0x4 for interrupt trigger when FIFO level is 5,
     * 0x5 for interrupt trigger when FIFO level is 6,
     * 0x6 for interrupt trigger when FIFO level is 7,
     * 0x7 for interrupt trigger when FIFO level is 8,
     * 0x8 for interrupt trigger when FIFO level is 9,
     * 0x9 for interrupt trigger when FIFO level is 10,
     * 0xa for interrupt trigger when FIFO level is 11,
     * 0xb for interrupt trigger when FIFO level is 12,
     * 0xc for interrupt trigger when FIFO level is 13,
     * 0xd for interrupt trigger when FIFO level is 14,
     * 0xe for interrupt trigger when FIFO level is 15,
     * 0xf for interrupt trigger when FIFO level is 16
     */
#define TOFF_I2SC_TFCR          0x002C		/* (RW) Transmit FIFO Configuration Register */
  #define I2CS_TFCR_TXCHET          0x0000000F	/* program the trigger level in the TX FIFO at which the receiver data available interrupt generate */
  /* * 0x0 for interrupt trigger when FIFO level is 1,
     * 0x2 for interrupt trigger when FIFO level is 2,
     * 0x3 for interrupt trigger when FIFO level is 4,
     * 0x4 for interrupt trigger when FIFO level is 5,
     * 0x5 for interrupt trigger when FIFO level is 6,
     * 0x6 for interrupt trigger when FIFO level is 7,
     * 0x7 for interrupt trigger when FIFO level is 8,
     * 0x8 for interrupt trigger when FIFO level is 9,
     * 0x9 for interrupt trigger when FIFO level is 10,
     * 0xa for interrupt trigger when FIFO level is 11,
     * 0xb for interrupt trigger when FIFO level is 12,
     * 0xc for interrupt trigger when FIFO level is 13,
     * 0xd for interrupt trigger when FIFO level is 14,
     * 0xe for interrupt trigger when FIFO level is 15,
     * 0xf for interrupt trigger when FIFO level is 16
     */
#define TOFF_I2SC_RFF           0x0030		/* (RW) Receive FIFO Flush Register */
  #define I2SC_RFF_RXCHFR           0x00000001	/* receiver channel FIFO reset */
#define TOFF_I2SC_TFF           0x0034		/* (RW) Transmit FIFO Flush Register */
  #define I2SC_TFF_RTXCHFR          0x00000001	/* transmit channel FIFO reset */

#define I2S_CHANNEL_WINDOW_SIZE 0x0040
#define NUM_I2S_CHANNEL         4


/*
 *  I2C
 */
#define TADR_I2C0_BASE      (I2C0_BASE_ADDR)
#define TADR_I2C1_BASE      (I2C0_BASE_ADDR+0x10000)
#define TADR_I2C2_BASE      (I2C0_BASE_ADDR+0x20000)
#define TOFF_I2C_CON            0x0000		/* (RW) I2C Control Register */
  #define I2C_CON_MASTER_MODE           0x00000001
  #define I2C_CON_SPEED_MASK            0x00000006
  #define I2C_CON_10BITADDR_SLAVE       0x00000008
  #define I2C_CON_RESTART_EN            0x00000020
  #define I2C_CON_SLAVE_DISABLE         0x00000040
  #define I2C_CON_STOP_DET_IFADDRESSED  0x00000080
  #define I2C_CON_TX_EMPTY_CTRL         0x00000100
#define TOFF_I2C_TAR            0x0004		/* (RW) I2C Target Address Register */
  #define I2C_TAR_ADDRESS_MASK          0x000003FF
  #define I2C_TAR_GC_OR_START           0x00000400
  #define I2C_TAR_SPECIAL               0x00000800
  #define I2C_TAR_10BITADDR_MASTER      0x00001000
#define TOFF_I2C_SAR            0x0008		/* (RW) I2C Slave Address Register */
  #define I2C_SAR_ADDRESS_MASK          0x000003FF
#define TOFF_I2C_DATA_CMD       0x0010		/* (RW) I2C Data Buffer and Command Register */
  #define I2C_DATA_CMD_CMD              0x00000100
  #define I2C_DATA_CMD_DATA_MASK        0x000000FF
#define TOFF_I2C_SS_SCL_HCNT    0x0014		/* (RW) I2C Standard Speed Clock SCL High Count Register */
#define TOFF_I2C_SS_SCL_LCNT    0x0018		/* (RW) I2C Standard Speed Clock SCL Low Count Register */
#define TOFF_I2C_INTR_STAT      0x002C		/* (RW) I2C Interrupt Status Register */
  #define I2C_INTR_STAT_RX_UNDER        0x00000001
  #define I2C_INTR_STAT_RX_OVER         0x00000002
  #define I2C_INTR_STAT_RX_FULL         0x00000004
  #define I2C_INTR_STAT_TX_OVER         0x00000008
  #define I2C_INTR_STAT_TX_EMPTY        0x00000010
  #define I2C_INTR_STAT_RD_REQ          0x00000020
  #define I2C_INTR_STAT_TX_ABRT         0x00000040
  #define I2C_INTR_STAT_RX_DONE         0x00000080
  #define I2C_INTR_STAT_ACTIVITY        0x00000100
  #define I2C_INTR_STAT_STOP_DET        0x00000200
  #define I2C_INTR_STAT_START_DET       0x00000400
  #define I2C_INTR_STAT_GEN_CALL        0x00000800
#define TOFF_I2C_INTR_MASK      0x0030		/* (RW) I2C Interrupt Mask Register */
  #define I2C_INTR_MASK_RX_UNDER        0x00000001
  #define I2C_INTR_MASK_RX_OVER         0x00000002
  #define I2C_INTR_MASK_RX_FULL         0x00000004
  #define I2C_INTR_MASK_TX_OVER         0x00000008
  #define I2C_INTR_MASK_TX_EMPTY        0x00000010
  #define I2C_INTR_MASK_RD_REQ          0x00000020
  #define I2C_INTR_MASK_TX_ABRT         0x00000040
  #define I2C_INTR_MASK_RX_DONE         0x00000080
  #define I2C_INTR_MASK_ACTIVITY        0x00000100
  #define I2C_INTR_MASK_STOP_DET        0x00000200
  #define I2C_INTR_MASK_START_DET       0x00000400
  #define I2C_INTR_MASK_GEN_CALL        0x00000800
#define TOFF_I2C_RAW_INTR_STAT  0x0034		/* (RW) I2C Raw Interrupt Status Register */
  #define I2C_RAW_INTR_MASK_RX_UNDER    0x00000001
  #define I2C_RAW_INTR_MASK_RX_OVER     0x00000002
  #define I2C_RAW_INTR_MASK_RX_FULL     0x00000004
  #define I2C_RAW_INTR_MASK_TX_OVER     0x00000008
  #define I2C_RAW_INTR_MASK_TX_EMPTY    0x00000010
  #define I2C_RAW_INTR_MASK_RD_REQ      0x00000020
  #define I2C_RAW_INTR_MASK_TX_ABRT     0x00000040
  #define I2C_RAW_INTR_MASK_RX_DONE     0x00000080
  #define I2C_RAW_INTR_MASK_ACTIVITY    0x00000100
  #define I2C_RAW_INTR_MASK_STOP_DET    0x00000200
  #define I2C_RAW_INTR_MASK_START_DET   0x00000400
  #define I2C_RAW_INTR_MASK_GEN_CALL    0x00000800
#define TOFF_I2C_RX_TL          0x0038		/* (RW) I2C Receive FIFO Threshold Register */
  #define I2C_RX_TL_VALUE_MASK          0x00000007
#define TOFF_I2C_TX_TL          0x003C		/* (RW) I2C Transmit FIFO Threshold Register */
  #define I2C_TX_TL_VALUE_MASK          0x00000007
#define TOFF_I2C_CLR_INTR       0x0040		/* (RW) I2C Clear Combined and Individual Interrupt Register */
  #define I2C_CLR_INTR_CLR              0x00000001
#define TOFF_I2C_CLR_RX_UNDER   0x0044		/* (RW) I2C Clear RX_UNDER Interrupt Register */
  #define I2C_CLR_RX_UNDER_CLR          0x00000001
#define TOFF_I2C_CLR_RX_OVER    0x0048		/* (RW) I2C Clear RX_OVER Interrupt Register */
  #define I2C_CLR_RX_OVER_CLR           0x00000001
#define TOFF_I2C_CLR_TX_OVER    0x004C		/* (RW) I2C Clear TX_OVER Interrupt Register */
  #define I2C_CLR_TX_OVER_CLR           0x00000001
#define TOFF_I2C_CLR_RD_REQ     0x0050		/* (RW) I2C Clear RD_REQ Interrupt Register */
  #define I2C_CLR_RD_REQ_CLR            0x00000001
#define TOFF_I2C_CLR_TX_ABRT    0x0054		/* (RW) I2C Clear TX_ABRT Interrupt Register */
  #define I2C_CLR_TX_ABRT_CLR           0x00000001
#define TOFF_I2C_CLR_RX_DONE    0x0058		/* (RW) I2C Clear RX_DONE Interrupt Register */
  #define I2C_CLR_RX_DONE_CLR           0x00000001
#define TOFF_I2C_CLR_ACTIVITY   0x005C		/* (RW) I2C Clear ACTIVITY Interrupt Register */
  #define I2C_CLR_ACTIVITY_CLR          0x00000001
#define TOFF_I2C_CLR_STOP_DET   0x0060		/* (RW) I2C Clear STOP_DET Interrupt Register */
  #define I2C_CLR_STOP_DET_CLR          0x00000001
#define TOFF_I2C_CLR_START_DET  0x0064		/* (RW) I2C Clear START_DET Interrupt Register */
  #define I2C_CLR_START_DET_CLR         0x00000001
#define TOFF_I2C_CLR_GEN_CALL   0x0068		/* (RW) I2C Clear GEN_CALL Interrupt Register */
  #define I2C_CLR_GEN_CALL_CLR          0x00000001
#define TOFF_I2C_ENABLE         0x006C		/* (RW) I2C Enable Register */
  #define I2C_ENABLE_ENABLE             0x00000001
  #define I2C_ENABLE_ABORT              0x00000002
  #define I2C_ENABLE_TX_CMD_BLOCK       0x00000004
#define TOFF_I2C_STATUS         0x0070		/* (RW) I2C Status Register */
  #define I2C_STATUS_ACTIVITY           0x00000001
  #define I2C_STATUS_TFNF               0x00000002
  #define I2C_STATUS_TFE                0x00000004
  #define I2C_STATUS_RFNE               0x00000008
  #define I2C_STATUS_RFF                0x00000010
  #define I2C_STATUS_MST_ACTIVITY       0x00000020
  #define I2C_STATUS_SLV_ACTIVITY       0x00000040
#define TOFF_I2C_TXFLR          0x0074		/* (RW) I2C Transmit FIFO Level Register */
  #define I2C_TXFLR_VALUE_MASK          0x00000007
#define TOFF_I2C_RXFLR          0x0078		/* (RW) I2C Receive FIFO Level Register */
  #define I2C_RXFLR_VALUE_MASK          0x00000007
#define TOFF_I2C_SDA_HOLD       0x007C		/* (RW) I2C SDA Hold Time Length Register */
  #define I2C_SDA_HOLD_TX_MASK          0x0000FFFF
  #define I2C_SDA_HOLD_RX_MASK          0x00FF0000
#define TOFF_I2C_TX_ABRT_SOURCE 0x0080		/* (RW) I2C Transmit Abort Source Register */
  #define I2C_TX_ABRT_SOURCE_7B_ADDR_NOACK   0x00000001
  #define I2C_TX_ABRT_SOURCE_10B_ADDR1_NOACK 0x00000002
  #define I2C_TX_ABRT_SOURCE_10B_ADDR2_NOACK 0x00000004
  #define I2C_TX_ABRT_SOURCE_TXDATA_NOACK    0x00000008
  #define I2C_TX_ABRT_SOURCE_GCALL_NOACK     0x00000010
  #define I2C_TX_ABRT_SOURCE_GCALL_READ      0x00000020
  #define I2C_TX_ABRT_SOURCE_HS_ACKDET       0x00000040
  #define I2C_TX_ABRT_SOURCE_SBYTE_ACKDET    0x00000080
  #define I2C_TX_ABRT_SOURCE_HS_NORSTRT      0x00000100
  #define I2C_TX_ABRT_SOURCE_SBYTE_NORSTRT   0x00000200
  #define I2C_TX_ABRT_SOURCE_10B_RD_NORSTRT  0x00000400
  #define I2C_TX_ABRT_SOURCE_MASTER_DIS      0x00000800
  #define I2C_TX_ABRT_SOURCE_MST_ARBLOST     0x00001000
  #define I2C_TX_ABRT_SOURCE_SLVFLUSH_TXFIFO 0x00002000
  #define I2C_TX_ABRT_SOURCE_SLV_ARBLOST     0x00004000
  #define I2C_TX_ABRT_SOURCE_SLVRD_INTX      0x00008000
  #define I2C_TX_ABRT_SOURCE_USER_ABRT       0x00010000
#define TOFF_I2C_DMA_CR         0x0088		/* (RW) I2C DMA Control Register */
  #define I2C_DMA_CR_RDMAE              0x00000001
  #define I2C_DMA_CR_TDMAE              0x00000002
#define TOFF_I2C_DMA_TDLR       0x008C		/* (RW) I2C DMA Transmit Data Level Register */
  #define I2C_DMA_TDLR_VALUE_MASK       0x00000007
#define TOFF_I2C_DMA_RDLR       0x0090		/* (RW) I2C DMA Receive Data Level Register */
  #define I2C_DMA_RDLR_VALUE_MASK       0x00000007
#define TOFF_I2C_SDA_SETUP      0x0094		/* (RW) I2C SDA Setup Register */
  #define I2C_SDA_SETUP_VALUE_MASK      0x000000FF
#define TOFF_I2C_GENERAL_CALL   0x0098		/* (RW) I2C ACK General Call Register */
  #define I2C_ACK_GENERAL_CALL_ENABLE   0x00000001
#define TOFF_I2C_ENABLE_STATUS  0x009C		/* (RW) I2C Enable Status Register */
  #define I2C_ENABLE_STATUS_IC_ENABLE        0x00000001
  #define I2C_ENABLE_STATUS_SLV_DIS_BUSY     0x00000002
  #define I2C_ENABLE_STATUS_SLV_RX_DATA_LOST 0x00000004
#define TOFF_I2C_FS_SPKLEN      0x00A0		/* (RW) I2C SS, FS or FM+ spike suppression limit */
  #define I2C_FS_SPKLEN_VALUE_MASK      0x000000FF
#define TOFF_I2C_COMP_PARAM_1   0x00F4		/* (RW) I2C Component Parameter Register 1 */
  #define I2C_COMP_PARAM1_APB_DATA_WIDTH     0x00000003
  #define I2C_COMP_PARAM1_MAX_SPEED_MODE     0x0000000C
  #define I2C_COMP_PARAM1_HC_COUNT_VALUES    0x00000010
  #define I2C_COMP_PARAM1_INTR_IO            0x00000020
  #define I2C_COMP_PARAM1_HAS_DMA            0x00000040
  #define I2C_COMP_PARAM1_ENCODED_PARAMS     0x00000080
  #define I2C_COMP_PARAM1_RX_BUFFER_DEPTH    0x0000FF00
  #define I2C_COMP_PARAM1_TX_BUFFER_DEPTH    0x00FF0000
#define TOFF_I2C_COMP_VERSION   0x00F8		/* (RW) I2C Component Version Register */
#define TOFF_I2C_COMP_TYPE      0x00FC		/* (RW) I2C Component Type Register */


