YutakaMatsubara/toppers-asp_riscv/target/k210_gcc/kendryte-k210.h
/*
 *  FPIOA
 */
#define TADR_FPIOA_BASE     (FPIOA_BASE_ADDR)
#define FPIOA_NUM_IO        (48)
#define TOFF_FPIOA_IO       0x0000
  #define FPIOA_CH_SEL        0x000000FF	/* Channel select from 256 input. */
  #define FPIOA_DS            0x00000F00	/* Driving selector. */
  #define FPIOA_OE_EN         0x00001000	/* Static output enable, will AND with OE_INV. */
  #define FPIOA_OE_INV        0x00002000	/* Invert output enable. */
  #define FPIOA_DO_SEL        0x00004000	/* Data output select: 0 for DO, 1 for OE. */
  #define FPIOA_DO_INV        0x00008000	/* Invert the result of data output select (DO_SEL). */
  #define FPIOA_PU            0x00010000	/* Pull up enable. 0 for nothing, 1 for pull up. */
  #define FPIOA_PD            0x00020000	/* Pull down enable. 0 for nothing, 1 for pull down. */
  #define FPIOA_SL            0x00080000	/* Slew rate control enable. */
  #define FPIOA_IE_EN         0x00100000	/* Static input enable, will AND with IE_INV. */
  #define FPIOA_IE_INV        0x00200000	/* Invert input enable. */
  #define FPIOA_DI_INV        0x00400000	/* Invert Data input. */
  #define FPIOA_ST            0x00800000	/* Schmitt trigger. */
  #define FPIOA_PAD_DI        0x80000000	/* Read current IO's data input. */
#define TOFF_FPIOA_TIE_EN   (FPIOA_NUM_IO*4)
#define TOFF_FPIOA_TIE_VAL  (TOFF_FPIOA_TIE_EN+(FUNC_MAX/8))


/*
 *  TIMER
 */
#define TADR_TIMER0_BASE    (TIMER0_BASE_ADDR)
#define TADR_TIMER1_BASE    (TIMER0_BASE_ADDR+0x10000)
#define TADR_TIMER2_BASE    (TIMER0_BASE_ADDR+0x20000)
#define TOFF_TIMER_CHANNEL        0x0000	/* (RW) TIMER_N Register 20bytes * 4 */
#define TOFF_TIMER_INT_STATR      0x00A0	/* (RW) TIMER Interrupt Status Register */
#define TOFF_TIMER_EOI            0x00A4	/* (RW) TIMER Interrupt Clear Register */
#define TOFF_TIMER_RAW_INTR_STAT  0x00A8	/* (RW) TIMER Raw Interrupt Status Register */
#define TOFF_TIMER_COMP_VERSION   0x00AC	/* (RW) TIMER Component Version Register */
#define TOFF_TIMER_LOAD_COUNT2    0x00B0	/* (RW) TIMER_N Load Count2 Register 4 *4 */

/*
 *  TIMER CHANNEL WINDOW
 */
#define TOFF_TIMERC_LOAD_COUNT    0x0000	/* (RW) TIMER_N Load Count Register */
#define TOFF_TIMERC_CURRENT_VALUE 0x0004	/* (RW) TIMER_N Current Value Register */
#define TOFF_TIMERC_CONTROL       0x0008	/* (RW) TIMER_N Control Register */
  #define TIMERC_CR_ENABLE          0x00000001
  #define TIMERC_CR_MODE_MASK       0x00000002
  #define TIMERC_CR_FREE_MODE       0x00000000
  #define TIMERC_CR_USER_MODE       0x00000002
  #define TIMERC_CR_INTERRUPT_MASK  0x00000004
  #define TIMERC_CR_PWM_ENABLE      0x00000008
#define TOFF_TIMERC_EOI           0x000C	/* (RW) TIMER_N Interrupt Clear Register */
#define TOFF_TIMERC_INTR_STAT     0x0010	/* (RW) TIMER_N Interrupt Status Register */

#define TIMER_CHANNEL_WINDOW_SIZE 0x0014
#define NUM_TIMER_CHANNEL         4


/*
 *  WDT
 */
#define TADR_WDT0_BASE      (WDT0_BASE_ADDR)
#define TADR_WDT1_BASE      (WDT0_BASE_ADDR+0x10000)
#define TOFF_WDT_CR         0x0000		/* (RW) WDT Control Register */
  #define WDT_CR_ENABLE         0x00000001
  #define WDT_CR_RMOD_MASK      0x00000002
  #define WDT_CR_RMOD_RESET     0x00000000
  #define WDT_CR_RMOD_INTERRUPT 0x00000002
  #define WDT_CR_RPL_MASK       0x0000001C
#define TOFF_WDT_TORR       0x0004		/* (RW) WDT Timeout Range Register */
  #define WDT_TORR_TOP_MASK     0x000000FF
#define TOFF_WDT_CCVR       0x0008		/* (RW) WDT Current Counter Value Register */
#define TOFF_WDT_CRR        0x000C		/* (RW) WDT Counter Restart Register */
  #define WDT_CRR_MASK          0x00000076
#define TOFF_WDT_STAT       0x0010		/* (RW) WDT Interrupt Status Register */
#define TOFF_WDT_EOI        0x0014		/* (RW) WDT Interrupt Clear Register */
#define TOFF_WDT_PROT_LEVEL 0x001C		/* (RW) WDT Protection level Register */
  #define WDT_PROT_LEVEL_MASK   0x00000007
#define TOFF_WDT_CMP_PARAM5 0x00E4		/* (RW) WDT Component Parameters Register 5 */
#define TOFF_WDT_CMP_PARAM4 0x00E8		/* (RW) WDT Component Parameters Register 4 */
#define TOFF_WDT_CMP_PARAM3 0x00EC		/* (RW) WDT Component Parameters Register 3 */
#define TOFF_WDT_CMP_PARAM2 0x00F0		/* (RW) WDT Component Parameters Register 2 */
#define TOFF_WDT_CMP_PARAM1 0x00F4		/* (RW) WDT Component Parameters Register 1 */
  #define WDT_COMP_PARAM_1_WDT_ALWAYS_EN_MASK      0x00000001
  #define WDT_COMP_PARAM_1_WDT_DFLT_RMOD_MASK      0x00000002
  #define WDT_COMP_PARAM_1_WDT_DUAL_TOP_MASK       0x00000004
  #define WDT_COMP_PARAM_1_WDT_HC_RMOD_MASK        0x00000008
  #define WDT_COMP_PARAM_1_WDT_HC_RPL_MASK         0x00000010
  #define WDT_COMP_PARAM_1_WDT_HC_TOP_MASK         0x00000020
  #define WDT_COMP_PARAM_1_WDT_USE_FIX_TOP_MASK    0x00000040
  #define WDT_COMP_PARAM_1_WDT_PAUSE_MASK          0x00000080
  #define WDT_COMP_PARAM_1_APB_DATA_WIDTH_MASK     0x00000300
  #define WDT_COMP_PARAM_1_WDT_DFLT_RPL_MASK       0x00001C00
  #define WDT_COMP_PARAM_1_WDT_DFLT_TOP_MASK       0x000F0000
  #define WDT_COMP_PARAM_1_WDT_DFLT_TOP_INIT_MASK  0x00F00000
  #define WDT_COMP_PARAM_1_WDT_CNT_WIDTH_MASK      0x1F000000
#define TOFF_WDT_CMP_VER    0x00F8		/* (RW) WDT Component Version Register */
#define TOFF_WDT_CMP_TYPE   0x00FC		/* (RW) WDT Component Type Register */


/*
 *  SYSCTL
 */
#define TADR_SYSCTL_BASE    (SYSCTL_BASE_ADDR)
#define TOFF_SYSCTL_GIT_ID      0x0000			/* (RW) No. 0: Git short commit id */
#define TOFF_SYSCTL_CLK_FREQ    0x0004			/* (RW) No. 1: System clock base frequency */
#define TOFF_SYSCTL_PLL0        0x0008			/* (RW) No. 2: PLL0 controller */
  #define SYSCTL_PLL_CLKR0              0x0000000F	/* clkr0 : 4 */
  #define SYSCTL_PLL_CLKF0              0x000003F0	/* clkf0 : 6 */
  #define SYSCTL_PLL_CLKOD0             0x00003C00	/* clkod0 : 4 */
  #define SYSCTL_PLL_BWADJ0             0x000FC000	/* bwadj0 : 6 */
  #define SYSCTL_PLL_RESET0             0x00100000	/* pll_reset0 : 1 */
  #define SYSCTL_PLL_PWRD0              0x00200000	/* pll_pwrd0 : 1 */
  #define SYSCTL_PLL_INTFB0             0x00400000	/* pll_intfb0 : 1 */
  #define SYSCTL_PLL_BYPASS0            0x00800000	/* pll_bypass0 : 1 */
  #define SYSCTL_PLL_TEST0              0x01000000	/* pll_test0 : 1 */
  #define SYSCTL_PLL_OUT_EN0            0x02000000	/* pll_out_en0 : 1 */
  #define SYSCTL_PLL_TEST_EN            0x04000000	/* pll_test_en : 1 */
#define TOFF_SYSCTL_PLL1        0x000C			/* (RW) No. 3: PLL1 controller */
  #define SYSCTL_PLL_CLKR1              0x0000000F	/* clkr1 : 4 */
  #define SYSCTL_PLL_CLKF1              0x000003F0	/* clkf1 : 6 */
  #define SYSCTL_PLL_CLKOD1             0x00003C00	/* clkod1 : 4 */
  #define SYSCTL_PLL_BWADJ1             0x000FC000	/* bwadj1 : 6 */
  #define SYSCTL_PLL_RESET1             0x00100000	/* pll_reset1 : 1 */
  #define SYSCTL_PLL_PWRD1              0x00200000	/* pll_pwrd1 : 1 */
  #define SYSCTL_PLL_INTFB1             0x00400000	/* pll_intfb1 : 1 */
  #define SYSCTL_PLL_BYPASS1            0x00800000	/* pll_bypass1 : 1 */
  #define SYSCTL_PLL_TEST1              0x01000000	/* pll_test1 : 1 */
  #define SYSCTL_PLL_OUT_EN1            0x02000000	/* pll_out_en1 : 1 */
#define TOFF_SYSCTL_PLL2        0x0010			/* (RW) No. 4: PLL2 controller */
  #define SYSCTL_PLL_CLKR2              0x0000000F	/* clkr2 : 4 */
  #define SYSCTL_PLL_CLKF2              0x000003F0	/* clkf2 : 6 */
  #define SYSCTL_PLL_CLKOD2             0x00003C00	/* clkod2 : 4 */
  #define SYSCTL_PLL_BWADJ2             0x000FC000	/* bwadj2 : 6 */
  #define SYSCTL_PLL_RESET2             0x00100000	/* pll_reset2 : 1 */
  #define SYSCTL_PLL_PWRD2              0x00200000	/* pll_pwrd2 : 1 */
  #define SYSCTL_PLL_INTFB2             0x00400000	/* pll_intfb2 : 1 */
  #define SYSCTL_PLL_BYPASS2            0x00800000	/* pll_bypass2 : 1 */
  #define SYSCTL_PLL_TEST2              0x01000000	/* pll_test2 : 1 */
  #define SYSCTL_PLL_OUT_EN2            0x02000000	/* pll_out_en2 : 1 */
  #define SYSCTL_PLL_CKIN_SEL2          0x0C000000	/* pll_ckin_sel2 : 2 */
#define TOFF_SYSCTL_PLL_LOCK    0x0018			/* (RW) No. 6: PLL lock tester */
  #define SYSCTL_PLL_LOCK_LOCK0         0x00000003	/* pll_lock0 : 2 */
  #define SYSCTL_PLL_LOCK_SLIP_CLEAR0   0x00000004	/* pll_slip_clear0 : 1 */
  #define SYSCTL_PLL_LOCK_TEST_CLK_OUT0 0x00000008	/* test_clk_out0 : 1 */
  #define SYSCTL_PLL_LOCK_LOCK1         0x00000300	/* pll_lock1 : 2 */
  #define SYSCTL_PLL_LOCK_SLIP_CLEAR1   0x00000400	/* pll_slip_clear1 : 1 */
  #define SYSCTL_PLL_LOCK_TEST_CLK_OUT1 0x00000800	/* test_clk_out1 : 1 */
  #define SYSCTL_PLL_LOCK_LOCK2         0x00030000  /* pll_lock2 : 2 */
  #define SYSCTL_PLL_LOCK_SLIP_CLEAR2   0x00040000	/* pll_slip_clear2 : 1 */
  #define SYSCTL_PLL_LOCK_TEST_CLK_OUT2 0x00080000	/* test_clk_out2 : 1 */
#define TOFF_SYSCTL_ROM_ERROR   0x001C			/* (RW) No. 7: AXI ROM detector */
  #define SYSCTL_ROM_ERROR_NUL_ERROR    0x00000001	/* rom_mul_error : 1 */
  #define SYSCTL_ROM_ERROR_ONE_ERROR    0x00000002	/* rom_one_error : 1 */
#define TOFF_CLK_SEL0           0x0020			/* (RW) No. 8: Clock select controller0 */
  #define SYSCTL_CLK_SEL0_ACLK_SEL      0x00000001	/* aclk_sel : 1 */
  #define SYSCTL_CLK_SEL0_SOURCE_IN0    0x00000000
  #define SYSCTL_CLK_SEL0_SOURCE_PLL0   0x00000001
  #define SYSCTL_CLK_SEL0_ACLK_SDIVISER 0x00000006	/* aclk_divider_sel : 2 */
  #define SYSCTL_CLK_SEL0_APB0_CLK_SEL  0x00000038	/* apb0_clk_sel : 3 */
  #define SYSCTL_CLK_SEL0_APB1_CLK_SEL  0x000001C0	/* apb1_clk_sel : 3 */
  #define SYSCTL_CLK_SEL0_APB2_CLK_SEL  0x00000E00	/* apb2_clk_sel : 3 */
  #define SYSCTL_CLK_SEL0_SPI3_CLK_SEL  0x00001000	/* spi3_clk_sel : 1 */
  #define SYSCTL_CLK_SEL0_TIM0_CLK_SEL  0x00002000	/* timer0_clk_sel : 1 */
  #define SYSCTL_CLK_SEL0_TIM1_CLK_SEL  0x00004000	/* timer1_clk_sel : 1 */
  #define SYSCTL_CLK_SEL0_TIM2_CLK_SEL  0x00008000	/* timer2_clk_sel : 1 */
#define TOFF_CLK_SEL1           0x0024			/* (RW) No. 9: Clock select controller1 */
  #define SYSCTL_CLK_SEL1_SPI3S_CLK_SEL 0x00000001	/* spi3_sample_clk_sel : 1 */
#define TOFF_SYSCTL_CLK_EN_CENT 0x0028			/* (RW) No. 10: Central clock enable */
  #define SYSCTL_CLK_EN_CENT_CPU_CLK_EN   0x00000001	/* cpu_clk_en : 1 */
  #define SYSCTL_CLK_EN_CENT_SRAM0_CLK_EN 0x00000002	/* sram0_clk_en : 1 */
  #define SYSCTL_CLK_EN_CENT_SRAM1_CLK_EN 0x00000004	/* sram1_clk_en : 1 */
  #define SYSCTL_CLK_EN_CENT_APB0_CLK_EN  0x00000008	/* apb0_clk_en : 1 */
  #define SYSCTL_CLK_EN_CENT_APB1_CLK_EN  0x00000010	/* apb1_clk_en : 1 */
  #define SYSCTL_CLK_EN_CENT_APB2_CLK_EN  0x00000020	/* apb2_clk_en : 1 */
#define TOFF_SYSCTL_CLK_EN_PERI 0x002C			/* (RW) No. 11: Peripheral clock enable */
  #define SYSCTL_CLK_EN_PERI_ROM_CLK_EN   0x00000001	/* rom_clk_en : 1 */
  #define SYSCTL_CLK_EN_PERI_DMA_CLK_EN   0x00000002	/* dma_clk_en : 1 */
  #define SYSCTL_CLK_EN_PERI_AI_CLK_EN    0x00000004	/* ai_clk_en : 1 */
  #define SYSCTL_CLK_EN_PERI_DVP_CLK_EN   0x00000008	/* dvp_clk_en : 1 */
  #define SYSCTL_CLK_EN_PERI_FFT_CLK_EN   0x00000010	/* fft_clk_en : 1 */
  #define SYSCTL_CLK_EN_PERI_GPIO_CLK_EN  0x00000020	/* gpio_clk_en : 1 */
  #define SYSCTL_CLK_EN_PERI_SPI0_CLK_EN  0x00000040	/* spi0_clk_en : 1 */
  #define SYSCTL_CLK_EN_PERI_SPI1_CLK_EN  0x00000080	/* spi1_clk_en : 1 */
  #define SYSCTL_CLK_EN_PERI_SPI2_CLK_EN  0x00000100	/* spi2_clk_en : 1 */
  #define SYSCTL_CLK_EN_PERI_SPI3_CLK_EN  0x00000200	/* spi3_clk_en : 1 */
  #define SYSCTL_CLK_EN_PERI_I2S0_CLK_EN  0x00000400	/* i2s0_clk_en : 1 */
  #define SYSCTL_CLK_EN_PERI_I2S1_CLK_EN  0x00000800	/* i2s1_clk_en : 1 */
  #define SYSCTL_CLK_EN_PERI_I2S2_CLK_EN  0x00001000	/* i2s2_clk_en : 1 */
  #define SYSCTL_CLK_EN_PERI_I2C0_CLK_EN  0x00002000	/* i2c0_clk_en : 1 */
  #define SYSCTL_CLK_EN_PERI_I2C1_CLK_EN  0x00004000	/* i2c1_clk_en : 1 */
  #define SYSCTL_CLK_EN_PERI_I2C2_CLK_EN  0x00008000	/* i2c2_clk_en : 1 */
  #define SYSCTL_CLK_EN_PERI_UART1_CLK_EN 0x00010000	/* uart1_clk_en : 1 */
  #define SYSCTL_CLK_EN_PERI_UART2_CLK_EN 0x00020000	/* uart2_clk_en : 1 */
  #define SYSCTL_CLK_EN_PERI_UART3_CLK_EN 0x00040000	/* uart3_clk_en : 1 */
  #define SYSCTL_CLK_EN_PERI_AES_CLK_EN   0x00080000	/* aes_clk_en : 1 */
  #define SYSCTL_CLK_EN_PERI_FPIOA_CLK_EN 0x00100000	/* fpioa_clk_en : 1 */
  #define SYSCTL_CLK_EN_PERI_TIM0_CLK_EN  0x00200000	/* timer0_clk_en : 1 */
  #define SYSCTL_CLK_EN_PERI_TIM1_CLK_EN  0x00400000	/* timer1_clk_en : 1 */
  #define SYSCTL_CLK_EN_PERI_TIM2_CLK_EN  0x00800000	/* timer2_clk_en : 1 */
  #define SYSCTL_CLK_EN_PERI_WDT0_CLK_EN  0x01000000	/* wdt0_clk_en : 1 */
  #define SYSCTL_CLK_EN_PERI_WDT1_CLK_EN  0x02000000	/* wdt1_clk_en : 1 */
  #define SYSCTL_CLK_EN_PERI_SHA_CLK_EN   0x04000000	/* sha_clk_en : 1 */
  #define SYSCTL_CLK_EN_PERI_OTP_CLK_EN   0x08000000	/* otp_clk_en : 1 */
  #define SYSCTL_CLK_EN_PERI_RTC_CLK_EN   0x20000000	/* rtc_clk_en : 1 */
#define TOFF_SYSCTL_SOFT_RESET  0x0030			/* (RW) No. 12: Soft reset ctrl */
  #define SYSCTL_SOFT_RESET_RESET         0x00000001	/* soft_reset : 1 */
#define TOFF_SYSCTL_PERI_RESET  0x0034			/* (RW) No. 13: Peripheral reset controller */
  #define SYSCTL_PERI_RESET_ROM_RESET     0x00000001	/* rom_reset : 1 */
  #define SYSCTL_PERI_RESET_DMA_RESET     0x00000002	/* dma_reset : 1 */
  #define SYSCTL_PERI_RESET_AI_RESET      0x00000004	/* ai_reset : 1 */
  #define SYSCTL_PERI_RESET_DVP_RESET     0x00000008	/* dvp_reset : 1 */
  #define SYSCTL_PERI_RESET_FFT_RESET     0x00000010	/* fft_reset : 1 */
  #define SYSCTL_PERI_RESET_GPIO_RESET    0x00000020	/* gpio_reset : 1 */
  #define SYSCTL_PERI_RESET_SPI0_RESET    0x00000040	/* spi0_reset : 1 */
  #define SYSCTL_PERI_RESET_SPI1_RESET    0x00000080	/* spi1_reset : 1 */
  #define SYSCTL_PERI_RESET_SPI2_RESET    0x00000100	/* spi2_reset : 1 */
  #define SYSCTL_PERI_RESET_SPI3_RESET    0x00000200	/* spi3_reset : 1 */
  #define SYSCTL_PERI_RESET_I2S0_RESET    0x00000400	/* i2s0_reset : 1 */
  #define SYSCTL_PERI_RESET_I2S1_RESET    0x00000800	/* i2s1_reset : 1 */
  #define SYSCTL_PERI_RESET_I2S2_RESET    0x00001000	/* i2s2_reset : 1 */
  #define SYSCTL_PERI_RESET_I2C0_RESET    0x00002000	/* i2c0_reset : 1 */
  #define SYSCTL_PERI_RESET_I2C1_RESET    0x00004000	/* i2c1_reset : 1 */
  #define SYSCTL_PERI_RESET_I2C2_RESET    0x00008000	/* i2c2_reset : 1 */
  #define SYSCTL_PERI_RESET_UART1_RESET   0x00010000	/* uart1_reset : 1 */
  #define SYSCTL_PERI_RESET_UART2_RESET   0x00020000	/* uart2_reset : 1 */
  #define SYSCTL_PERI_RESET_UART3_RESET   0x00040000	/* uart3_reset : 1 */
  #define SYSCTL_PERI_RESET_AES_RESET     0x00080000	/* aes_reset : 1 */
  #define SYSCTL_PERI_RESET_FPIOA_RESET   0x00100000	/* fpioa_reset : 1 */
  #define SYSCTL_PERI_RESET_TIM0_RESET    0x00200000	/* timer0_reset : 1 */
  #define SYSCTL_PERI_RESET_TIM1_RESET    0x00400000	/* timer1_reset : 1 */
  #define SYSCTL_PERI_RESET_TIM2_RESET    0x00800000	/* timer2_reset : 1 */
  #define SYSCTL_PERI_RESET_WDT0_RESET    0x01000000	/* wdt0_reset : 1 */
  #define SYSCTL_PERI_RESET_WDT1_RESET    0x02000000	/* wdt1_reset : 1 */
  #define SYSCTL_PERI_RESET_SHA_RESET     0x04000000	/* sha_reset : 1 */
  #define SYSCTL_PERI_RESET_RTC_RESET     0x20000000	/* rtc_reset : 1 */
#define TOFF_SYSCTL_CLK_TH0     0x0038			/* (RW) No. 14: Clock threshold controller 0 */
  #define SYSCTL_CLK_TH0_SRAM0_GCLK_THHD  0x0000000F	/* sram0_gclk_threshold : 4 */
  #define SYSCTL_CLK_TH0_SRAM1_GCLK_THHD  0x000000F0	/* sram1_gclk_threshold : 4 */
  #define SYSCTL_CLK_TH0_AI_GCLK_THHD     0x00000F00	/* ai_gclk_threshold : 4 */
  #define SYSCTL_CLK_TH0_DVP_GCLK_THHD    0x0000F000	/* dvp_gclk_threshold : 4 */
  #define SYSCTL_CLK_TH0_ROM_GCLK_THHD    0x000F0000	/* rom_gclk_threshold : 4 */
#define TOFF_SYSCTL_CLK_TH1     0x003C			/* (RW) No. 15: Clock threshold controller 1 */
  #define SYSCTL_CLK_TH1_SPI0_CLK_THHD    0x000000FF	/* spi0_clk_threshold : 8 */
  #define SYSCTL_CLK_TH1_SPI1_CLK_THHD    0x0000FF00	/* spi1_clk_threshold : 8 */
  #define SYSCTL_CLK_TH1_SPI2_CLK_THHD    0x00FF0000	/* spi2_clk_threshold : 8 */
  #define SYSCTL_CLK_TH1_SPI3_CLK_THHD    0xFF000000	/* spi3_clk_threshold : 8 */
#define TOFF_SYSCTL_CLK_TH2     0x0040			/* (RW) No. 16: Clock threshold controller 2 */
  #define SYSCTL_CLK_TH2_TM0_CLK_THHD     0x000000FF	/* timer0_clk_threshold : 8 */
  #define SYSCTL_CLK_TH2_TM1_CLK_THHD     0x0000FF00	/* timer1_clk_threshold : 8 */
  #define SYSCTL_CLK_TH2_TM2_CLK_THHD     0x00FF0000	/* timer2_clk_threshold : 8 */
#define TOFF_SYSCTL_CLK_TH3     0x0044			/* (RW) No. 17: Clock threshold controller 3 */
  #define SYSCTL_CLK_TH3_I2S0_CLK_THHD    0x0000FFFF	/* i2s0_clk_threshold : 16 */
  #define SYSCTL_CLK_TH3_I2S1_CLK_THHD    0xFFFF0000	/* i2s1_clk_threshold : 16 */
#define TOFF_SYSCTL_CLK_TH4     0x0048			/* (RW) No. 18: Clock threshold controller 4 */
  #define SYSCTL_CLK_TH4_I2S2_CLK_THHD    0x0000FFFF	/* i2s2_clk_threshold : 16 */
  #define SYSCTL_CLK_TH4_I2S0_MCLK_THHD   0x00FF0000	/* i2s0_mclk_threshold : 8 */
  #define SYSCTL_CLK_TH4_I2S1_MCLK_THHD   0xFF000000	/* i2s1_mclk_threshold : 8 */
#define TOFF_SYSCTL_CLK_TH5     0x004C			/* (RW) No. 19: Clock threshold controller 5 */
  #define SYSCTL_CLK_TH5_I2S2_MCLK_THHD   0x000000FF	/* i2s2_mclk_threshold : 8 */
  #define SYSCTL_CLK_TH5_I2C0_CLK_THHD    0x0000FF00	/* i2c0_clk_threshold : 8 */
  #define SYSCTL_CLK_TH5_I2C1_CLK_THHD    0x00FF0000	/* i2c1_clk_threshold : 8 */
  #define SYSCTL_CLK_TH5_I2C2_CLK_THHD    0xFF000000	/* i2c2_clk_threshold : 8 */
#define TOFF_SYSCTL_CLK_TH6     0x0050			/* (RW) No. 20: Clock threshold controller 6 */
  #define SYSCTL_CLK_TH6_WD0_CLK_THHD     0x000000FF	/* wdt0_clk_threshold : 8 */
  #define SYSCTL_CLK_TH6_WD1_CLK_THHD     0x0000FF00	/* wdt1_clk_threshold : 8 */
#define TOFF_SYSCTL_MISC        0x0054			/* (RW) No. 21: Miscellaneous controller */
  #define SYSCTL_MISC_DEBUG_SEL           0x0000003F	/* debug_sel : 6 */
  #define SYSCTL_MISC_SPI_DVP_DATA_ENABLE 0x00000400	/* spi_dvp_data_enable: 1 */
#define TOFF_SYSCTL_PERI        0x0058			/* (RW) No. 22: Peripheral controller */
  #define SYSCTL_PERI_TIMER0_PAUSE        0x00000001	/* timer0_pause : 1 */
  #define SYSCTL_PERI_TIMER1_PAUSE        0x00000002	/* timer1_pause : 1 */
  #define SYSCTL_PERI_TIMER2_PAUSE        0x00000004	/* timer2_pause : 1 */
  #define SYSCTL_PERI_TIMER3_PAUSE        0x00000008	/* timer3_pause : 1 */
  #define SYSCTL_PERI_TIMER4_PAUSE        0x00000010	/* timer4_pause : 1 */
  #define SYSCTL_PERI_TIMER5_PAUSE        0x00000020	/* timer5_pause : 1 */
  #define SYSCTL_PERI_TIMER6_PAUSE        0x00000040	/* timer6_pause : 1 */
  #define SYSCTL_PERI_TIMER7_PAUSE        0x00000080	/* timer7_pause : 1 */
  #define SYSCTL_PERI_TIMER8_PAUSE        0x00000100	/* timer8_pause : 1 */
  #define SYSCTL_PERI_TIMER9_PAUSE        0x00000200	/* timer9_pause : 1 */
  #define SYSCTL_PERI_TIMER10_PAUSE       0x00000400	/* timer10_pause : 1 */
  #define SYSCTL_PERI_TIMER11_PAUSE       0x00000800	/* timer11_pause : 1 */
  #define SYSCTL_PERI_SPI0_XIP_EN         0x00001000	/* spi0_xip_en : 1 */
  #define SYSCTL_PERI_SPI1_XIP_EN         0x00002000	/* spi1_xip_en : 1 */
  #define SYSCTL_PERI_SPI2_XIP_EN         0x00004000	/* spi2_xip_en : 1 */
  #define SYSCTL_PERI_SPI3_XIP_EN         0x00008000	/* spi3_xip_en : 1 */
  #define SYSCTL_PERI_SPI0_CLK_BYPASS     0x00010000	/* spi0_clk_bypass : 1 */
  #define SYSCTL_PERI_SPI1_CLK_BYPASS     0x00020000	/* spi1_clk_bypass : 1 */
  #define SYSCTL_PERI_SPI2_CLK_BYPASS     0x00040000	/* spi2_clk_bypass : 1 */
  #define SYSCTL_PERI_I2S0_CLK_BYPASS     0x00080000	/* i2s0_clk_bypass : 1 */
  #define SYSCTL_PERI_I2S1_CLK_BYPASS     0x00100000	/* i2s1_clk_bypass : 1 */
  #define SYSCTL_PERI_I2S2_CLK_BYPASS     0x00200000	/* i2s2_clk_bypass : 1 */
  #define SYSCTL_PERI_JTAG_CLK_BYPASS     0x00400000	/* jtag_clk_bypass : 1 */
  #define SYSCTL_PERI_DVP_CLK_BYPASS      0x00800000	/* dvp_clk_bypass : 1 */
  #define SYSCTL_PERI_DEBUG_CLK_BYPASS    0x01000000	/* debug_clk_bypass : 1 */
#define TOFF_SYSCTL_SPI_SLEEP   0x005C			/* (RW) No. 23: SPI sleep controller */
  #define SYSCTL_SPI_SLEEP_SSI0_SLEEP     0x00000001	/* ssi0_sleep : 1 */
  #define SYSCTL_SPI_SLEEP_SSI1_SLEEP     0x00000002	/* ssi1_sleep : 1 */
  #define SYSCTL_SPI_SLEEP_SSI2_SLEEP     0x00000004	/* ssi2_sleep : 1 */
  #define SYSCTL_SPI_SLEEP_SSI3_SLEEP     0x00000008	/* ssi3_sleep : 1 */
#define TOFF_SYSCTL_RST_STATUS  0x0060			/* (RW) No. 24: Reset source status */
  #define SYSCTL_RST_STATUS_RESET_STS_CLR 0x00000001	/* reset_sts_clr : 1 */
  #define SYSCTL_RST_STATUS_PIN_RESET_STS 0x00000002	/* pin_reset_sts : 1 */
  #define SYSCTL_RST_STATUS_WDT0_RESET_STS 0x00000004	/* wdt0_reset_sts : 1 */
  #define SYSCTL_RST_STATUS_WDT1_RESET_STS 0x00000008	/* wdt1_reset_sts : 1 */
  #define SYSCTL_RST_STATUS_SOFT_RESET_STS 0x00000010	/* soft_reset_sts : 1 */
#define TOFF_SYSCTL_DMA_SEL0    0x0064			/* (RW) No. 25: DMA handshake selector */
  #define SYSCTL_DMA_SEL0_DMA_SEL0        0x0000003F	/* dma_sel0 : 6 */
  #define SYSCTL_DMA_SEL0_DMA_SEL1        0x00000FC0	/* dma_sel1 : 6 */
  #define SYSCTL_DMA_SEL0_DMA_SEL2        0x0003F000	/* dma_sel2 : 6 */
  #define SYSCTL_DMA_SEL0_DMA_SEL3        0x00FC0000	/* dma_sel3 : 6 */
  #define SYSCTL_DMA_SEL0_DMA_SEL4        0x3F000000	/* dma_sel4 : 6 */
#define TOFF_SYSCTL_DMA_SEL1    0x0068			/* (RW) No. 26: DMA handshake selector */
  #define SYSCTL_DMA_SEL0_DMA_SEL5        0x0000003F	/* dma_sel5 : 6 */
#define TOFF_SYSCTL_POWER_SEL   0x006C			/* (RW) No. 27: IO Power Mode Select controller */
  #define SYSCTL_POWER_SEL_POWER_MODE_0   0x00000001	/* power_mode_sel0 : 1 */
  #define SYSCTL_POWER_SEL_POWER_MODE_1   0x00000002	/* power_mode_sel1 : 1 */
  #define SYSCTL_POWER_SEL_POWER_MODE_2   0x00000004	/* power_mode_sel2 : 1 */
  #define SYSCTL_POWER_SEL_POWER_MODE_3   0x00000008	/* power_mode_sel3 : 1 */
  #define SYSCTL_POWER_SEL_POWER_MODE_4   0x00000010	/* power_mode_sel4 : 1 */
  #define SYSCTL_POWER_SEL_POWER_MODE_5   0x00000020	/* power_mode_sel5 : 1 */
  #define SYSCTL_POWER_SEL_POWER_MODE_6   0x00000040	/* power_mode_sel6 : 1 */
  #define SYSCTL_POWER_SEL_POWER_MODE_7   0x00000080	/* power_mode_sel7 : 1 */

