YutakaMatsubara/toppers-asp_riscv/target/k210_gcc/kendryte-k210.h
/*
 *  RTC
 */
#define TADR_RTC_BASE       (RTC_BASE_ADDR)
#define TOFF_RTC_DATE       0x0000		/* (RW) Timer date information */
  #define RTC_DATE_WEEK         0x00000007	/* Week. Range [0,6]. 0 is Sunday. */
  #define RTC_DATE_DAY          0x00001F00	/* Day. Range [1,31] or [1,30] or [1,29] or [1,28] */
  #define RTC_DATE_MONTH        0x000F0000	/* Month. Range [1,12] */
  #define RTC_DATE_YEAR         0x3FF00000	/* Year. Range [0,99] */
#define TOFF_RTC_TIME       0x0004		/* (RW) Timer time information */
  #define RTC_TIME_SECOND       0x0000FC00	/* Second. Range [0,59] */
  #define RTC_TIME_MINUTE       0x003F0000	/* Minute. Range [0,59] */
  #define RTC_TIME_HOUR         0x1F000000	/* Hour. Range [0,23] */
#define TOFF_ALARM_DATE     0x0008		/* (RW) Alarm date information */
  #define RTC_ALARM_DATE_WEEK   0x00000003	/* Alarm Week. Range [0,6]. 0 is Sunday. */
  #define RTC_ALARM_DATE_DAY    0x00001F00	/* Alarm Day. Range [1,31] or [1,30] or [1,29] or [1,28] */
  #define RTC_ALARM_DATE_MONTH  0x000F0000	/* Alarm Month. Range [1,12] */
  #define RTC_ALARM_DATE_YEAR   0x3FF00000	/* Alarm Year. Range [0,99] */
#define TOFF_ALARM_TIME     0x000C		/* (RW) Alarm time information */
  #define RTC_ALARM_TIME_SECOND 0x0000FC00	/* Alarm Second. Range [0,59] */
  #define RTC_ALARM_TIME_MINUTE 0x003F0000	/* Alarm Minute. Range [0,59] */
  #define RTC_ALARM_TIME_HOUR   0x1F000000	/* Alarm Hour. Range [0,23] */
#define TOFF_INITIAL_COUNT  0x0010		/* (RW) Timer counter initial value */
#define TOFF_COURRNT_COUNT  0x0014		/* (RW) Timer counter current value */
#define TOFF_INTERRUPT_CTRL 0x0018		/* (RW) RTC interrupt settings */
  #define RTC_INT_TICK_ENABLE   0x00000001	/* Reserved */
  #define RTC_INT_ALARM_ENABLE  0x00000002	/* Alarm interrupt enable */
  #define RTC_INT_TICK_INT_MODE 0x0000000C	/* Tick interrupt enable */
  #define RTC_INT_ARARM_C_MASK  0xFF000000	/* Alarm compare mask for interrupt */
#define TOFF_REGISTER_CTRL  0x001C		/* (RW) RTC register settings */
  #define RTC_RCTL_READ_ENABLE  0x00000001	/* RTC timer read enable */
  #define RTC_RCTL_WRITE_ENABLE 0x00000002	/* RTC timer write enable */
  #define RTC_RCTL_TIMER_MASK   0x001FE000	/* RTC timer mask */
  #define RTC_RCTL_ALARAM_MASK  0x1FE00000	/* RTC alarm mask */
  #define RTC_RCTL_INT_CNT_MASK 0x20000000	/* RTC counter initial count value mask */
  #define RTC_RCTL_INT_REG_MASK 0x40000000	/* RTC interrupt register mask */
#define TOFF_RTC_EXTENDED   0x0028			/* (RW) Timer extended information */
  #define RTC_EXTENDED_CENTURY  0x0000001F	/* Century. Range [0,31] */
  #define RTC_EXTENDED_YEAR     0x00000020	/* Is leap year. 1 is leap year, 0 is not leap year */


/*
 *  SPI
 */
#define TADR_SPI0_BASE      (SPI0_BASE_ADDR)
#define TADR_SPI1_BASE      (SPI1_BASE_ADDR)
#define TADR_SPIS_BASE      (SPI_SLAVE_BASE_ADDR)
#define TADR_SPI2_BASE      (SPI3_BASE_ADDR)
#define TOFF_SPI_CTRLR0         0x0000		/* (RW) SPI Control Register 0 */
#define TOFF_SPI_CTRLR1         0x0004		/* (RW) SPI Control Register 1 */
#define TOFF_SPI_SSIENR         0x0008		/* (RW) SPI Enable Register */
#define TOFF_SPI_MWCR           0x000C		/* (RW) SPI Microwire Control Register */
#define TOFF_SPI_SER            0x0010		/* (RW) SPI Slave Enable Register */
#define TOFF_SPI_BAUDR          0x0014		/* (RW) SPI Baud Rate Select */
#define TOFF_SPI_TXFTLR         0x0018		/* (RW) SPI Transmit FIFO Threshold Level */
#define TOFF_SPI_RXFTLR         0x001C		/* (RW) SPI Receive FIFO Threshold Level */
#define TOFF_SPI_TXFLR          0x0020		/* (RW) SPI Transmit FIFO Level Register */
#define TOFF_SPI_RXFLR          0x0024		/* (RW) SPI Receive FIFO Level Register */
#define TOFF_SPI_SR             0x0028		/* (RW) SPI Status Register */
#define TOFF_SPI_IMR            0x002C		/* (RW) SPI Interrupt Mask Register */
#define TOFF_SPI_ISR            0x0030		/* (RW) SPI Interrupt Status Register */
#define TOFF_SPI_RISR           0x0034		/* (RW) SPI Raw Interrupt Status Register */
#define TOFF_SPI_TXOICR         0x0038		/* (RW) SPI Transmit FIFO Overflow Interrupt Clear Register */
#define TOFF_SPI_RXOICR         0x003C		/* (RW) SPI Receive FIFO Overflow Interrupt Clear Register */
#define TOFF_SPI_RXUICR         0x0040		/* (RW) SPI Receive FIFO Underflow Interrupt Clear Register */
#define TOFF_SPI_MSTICR         0x0044		/* (RW) SPI Multi-Master Interrupt Clear Register */
#define TOFF_SPI_ICR            0x0048		/* (RW) SPI Interrupt Clear Register */
#define TOFF_SPI_DMACR          0x004C		/* (RW) SPI DMA Control Register */
#define TOFF_SPI_DMATDLR        0x0050		/* (RW) SPI DMA Transmit Data Level */
#define TOFF_SPI_DMARDLR        0x0054		/* (RW) SPI DMA Receive Data Level */
#define TOFF_SPI_IDR            0x0058		/* (RW) SPI Identification Register */
#define TOFF_SPI_SSIC_VER_ID    0x005C		/* (RW) SPI DWC_ssi component version */
#define TOFF_SPI_DR             0x0060		/* (RW) SPI Data Register 0-35 */
#define TOFF_SPI_RX_SAMPL_DELAY 0x00F0		/* (RW) SPI RX Sample Delay Register */
#define TOFF_SPI_SPI_CTRLR0     0x00F4		/* (RW) SPI SPI Control Register */
#define TOFF_SPI_XIP_MODE_BITS  0x00FC		/* (RW) SPI XIP Mode bits */
#define TOFF_SPI_XIP_INCR_INST  0x0100		/* (RW) SPI XIP INCR transfer opcode */
#define TOFF_SPI_XIP_WRAP_INST  0x0104		/* (RW) SPI XIP WRAP transfer opcode */
#define TOFF_SPI_XIP_CTRL       0x0108		/* (RW) SPI XIP Control Register */
#define TOFF_SPI_XIP_SER        0x010C		/* (RW) SPI XIP Slave Enable Register */
#define TOFF_SPI_XRXOICR        0x0110		/* (RW) SPI XIP Receive FIFO Overflow Interrupt Clear Register */
#define TOFF_SPI_XIP_CNT_TIMOUT 0x0114		/* (RW) SPI XIP time out register for continuous transfers */
#define TOFF_SPI_ENDIAN         0x0118

#endif /* _KENDRYTE_K210_H_ */
